TWilmer/s6e2cc/pdl/template/IAR/config/s6e1c3x/svd/S6E1C3.xml
      </registers>
    </peripheral>
    <!-- PERIPHERAL "CLOCK" -->
    <peripheral>
      <name>CLOCK</name>
      <description>Clock Unit Registers</description>
      <version>A</version>
      <groupName>CLOCK</groupName>
      <baseAddress>0x40010000</baseAddress>
      <!-- ADDRESS BLOCK -->
      <addressBlock>
        <offset>0x0</offset>
        <size>0x1</size>
        <usage>registers</usage>
      </addressBlock>
      <addressBlock>
        <offset>0x4</offset>
        <size>0x1</size>
        <usage>registers</usage>
      </addressBlock>
      <addressBlock>
        <offset>0x8</offset>
        <size>0x4</size>
        <usage>registers</usage>
      </addressBlock>
      <addressBlock>
        <offset>0xC</offset>
        <size>0x2</size>
        <usage>registers</usage>
      </addressBlock>
      <addressBlock>
        <offset>0x10</offset>
        <size>0x1</size>
        <usage>registers</usage>
      </addressBlock>
      <addressBlock>
        <offset>0x14</offset>
        <size>0x1</size>
        <usage>registers</usage>
      </addressBlock>
      <addressBlock>
        <offset>0x18</offset>
        <size>0x1</size>
        <usage>registers</usage>
      </addressBlock>
      <addressBlock>
        <offset>0x20</offset>
        <size>0x1</size>
        <usage>registers</usage>
      </addressBlock>
      <addressBlock>
        <offset>0x30</offset>
        <size>0x1</size>
        <usage>registers</usage>
      </addressBlock>
      <addressBlock>
        <offset>0x34</offset>
        <size>0x1</size>
        <usage>registers</usage>
      </addressBlock>
      <addressBlock>
        <offset>0x38</offset>
        <size>0x1</size>
        <usage>registers</usage>
      </addressBlock>
      <addressBlock>
        <offset>0x3C</offset>
        <size>0x1</size>
        <usage>registers</usage>
      </addressBlock>
      <addressBlock>
        <offset>0x40</offset>
        <size>0x2</size>
        <usage>registers</usage>
      </addressBlock>
      <addressBlock>
        <offset>0x44</offset>
        <size>0x1</size>
        <usage>registers</usage>
      </addressBlock>
      <addressBlock>
        <offset>0x48</offset>
        <size>0x2</size>
        <usage>registers</usage>
      </addressBlock>
      <addressBlock>
        <offset>0x4C</offset>
        <size>0x2</size>
        <usage>registers</usage>
      </addressBlock>
      <addressBlock>
        <offset>0x50</offset>
        <size>0x2</size>
        <usage>registers</usage>
      </addressBlock>
      <addressBlock>
        <offset>0x54</offset>
        <size>0x1</size>
        <usage>registers</usage>
      </addressBlock>
      <addressBlock>
        <offset>0x60</offset>
        <size>0x1</size>
        <usage>registers</usage>
      </addressBlock>
      <addressBlock>
        <offset>0x64</offset>
        <size>0x1</size>
        <usage>registers</usage>
      </addressBlock>
      <addressBlock>
        <offset>0x68</offset>
        <size>0x1</size>
        <usage>registers</usage>
      </addressBlock>
      <!-- INTERRUPT "CSV" -->
      <interrupt>
        <name>CSV</name>
        <value>0</value>
      </interrupt>
      <!-- INTERRUPT "TIM_ICC1_CEC1" -->
      <interrupt>
        <name>TIM_ICC1_CEC1</name>
        <value>24</value>
      </interrupt>
      <!-- REGISTERS -->
      <registers>
        <!-- REGISTER "SCM_CTL" -->
        <register>
          <name>SCM_CTL</name>
          <description>System Clock Mode Control Register</description>
          <addressOffset>0x0</addressOffset>
          <size>8</size>
          <access>read-write</access>
          <resetValue>0x00</resetValue>
          <resetMask>0xFB</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "RCS" -->
            <field>
              <name>RCS</name>
              <description>Master clock switch control bits</description>
              <msb>7</msb>
              <lsb>5</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "PLLE" -->
            <field>
              <name>PLLE</name>
              <description>PLL oscillation enable bit</description>
              <msb>4</msb>
              <lsb>4</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "SOSCE" -->
            <field>
              <name>SOSCE</name>
              <description>Sub clock oscillation enable bit</description>
              <msb>3</msb>
              <lsb>3</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "MOSCE" -->
            <field>
              <name>MOSCE</name>
              <description>Main clock oscillation enable bit</description>
              <msb>1</msb>
              <lsb>1</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "HCRE" -->
            <field>
              <name>HCRE</name>
              <description>High-speed CR clock oscillation enable bit</description>
              <msb>0</msb>
              <lsb>0</lsb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <!-- REGISTER "SCM_STR" -->
        <register>
          <name>SCM_STR</name>
          <description>System Clock Mode Status Register</description>
          <addressOffset>0x4</addressOffset>
          <size>8</size>
          <access>read-only</access>
          <resetValue>0x01</resetValue>
          <resetMask>0xFB</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "RCM" -->
            <field>
              <name>RCM</name>
              <description>Master clock selection bits</description>
              <msb>7</msb>
              <lsb>5</lsb>
              <access>read-only</access>
            </field>
            <!-- FIELD "PLRDY" -->
            <field>
              <name>PLRDY</name>
              <description>PLL oscillation stable bit</description>
              <msb>4</msb>
              <lsb>4</lsb>
              <access>read-only</access>
            </field>
            <!-- FIELD "SORDY" -->
            <field>
              <name>SORDY</name>
              <description>Sub clock oscillation stable bit</description>
              <msb>3</msb>
              <lsb>3</lsb>
              <access>read-only</access>
            </field>
            <!-- FIELD "MORDY" -->
            <field>
              <name>MORDY</name>
              <description>Main clock oscillation stable bit</description>
              <msb>1</msb>
              <lsb>1</lsb>
              <access>read-only</access>
            </field>
            <!-- FIELD "HCRDY" -->
            <field>
              <name>HCRDY</name>
              <description>High-speed CR clock oscillation stable bit</description>
              <msb>0</msb>
              <lsb>0</lsb>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <!-- REGISTER "BSC_PSR" -->
        <register>
          <name>BSC_PSR</name>
          <description>Base Clock Prescaler Register</description>
          <addressOffset>0x10</addressOffset>
          <size>8</size>
          <access>read-write</access>
          <resetValue>0x00</resetValue>
          <resetMask>0x07</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "BSR" -->
            <field>
              <name>BSR</name>
              <description>Base clock frequency division ratio setting bits</description>
              <msb>2</msb>
              <lsb>0</lsb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <!-- REGISTER "APBC0_PSR" -->
        <register>
          <name>APBC0_PSR</name>
          <description>APB0 Prescaler Register</description>
          <addressOffset>0x14</addressOffset>
          <size>8</size>
          <access>read-write</access>
          <resetValue>0x00</resetValue>
          <resetMask>0x03</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "APBC0" -->
            <field>
              <name>APBC0</name>
              <description>APB0 bus clock frequency division ratio setting bits</description>
              <msb>1</msb>
              <lsb>0</lsb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <!-- REGISTER "APBC1_PSR" -->
        <register>
          <name>APBC1_PSR</name>
          <description>APB1 Prescaler Register</description>
          <addressOffset>0x18</addressOffset>
          <size>8</size>
          <access>read-write</access>
          <resetValue>0x80</resetValue>
          <resetMask>0x93</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "APBC1EN" -->
            <field>
              <name>APBC1EN</name>
              <description>APB1 clock enable bit</description>
              <msb>7</msb>
              <lsb>7</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "APBC1RST" -->
            <field>
              <name>APBC1RST</name>
              <description>APB1 bus reset control bit</description>
              <msb>4</msb>
              <lsb>4</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "APBC1" -->
            <field>
              <name>APBC1</name>
              <description>APB1 bus clock frequency division ratio setting bits</description>
              <msb>1</msb>
              <lsb>0</lsb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <!-- REGISTER "SWC_PSR" -->
        <register>
          <name>SWC_PSR</name>
          <description>Software Watchdog Clock Prescaler Register</description>
          <addressOffset>0x20</addressOffset>
          <size>8</size>
          <access>read-write</access>
          <resetValue>0x00</resetValue>
          <resetMask>0x83</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "TESTB" -->
            <field>
              <name>TESTB</name>
              <description>TEST bit</description>
              <msb>7</msb>
              <lsb>7</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "SWDS" -->
            <field>
              <name>SWDS</name>
              <description>Software watchdog clock frequency division ratio setting bits</description>
              <msb>1</msb>
              <lsb>0</lsb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <!-- REGISTER "CSW_TMR" -->
        <register>
          <name>CSW_TMR</name>
          <description>Clock Stabilization Wait Time Register</description>
          <addressOffset>0x30</addressOffset>
          <size>8</size>
          <access>read-write</access>
          <resetValue>0x00</resetValue>
          <resetMask>0xFF</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "SOWT" -->
            <field>
              <name>SOWT</name>
              <description>Sub clock stabilization wait time setup bits</description>
              <msb>7</msb>
              <lsb>4</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "MOWT" -->
            <field>
              <name>MOWT</name>
              <description>Main clock stabilization wait time setup bits</description>
              <msb>3</msb>
              <lsb>0</lsb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <!-- REGISTER "PSW_TMR" -->
        <register>
          <name>PSW_TMR</name>
          <description>PLL Clock Stabilization Wait Time Setup Register</description>
          <addressOffset>0x34</addressOffset>
          <size>8</size>
          <access>read-write</access>
          <resetValue>0x00</resetValue>
          <resetMask>0x17</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "PINC" -->
            <field>
              <name>PINC</name>
              <description>PLL input clock select bit</description>
              <msb>4</msb>
              <lsb>4</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "POWT" -->
            <field>
              <name>POWT</name>
              <description>Main PLL clock stabilization wait time setup bits</description>
              <msb>2</msb>
              <lsb>0</lsb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <!-- REGISTER "PLL_CTL1" -->
        <register>
          <name>PLL_CTL1</name>
          <description>PLL Control Register 1</description>
          <addressOffset>0x38</addressOffset>
          <size>8</size>
          <access>read-write</access>
          <resetValue>0x00</resetValue>
          <resetMask>0xFF</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "PLLK" -->
            <field>
              <name>PLLK</name>
              <description>PLL input clock frequency division ratio setting bits</description>
              <msb>7</msb>
              <lsb>4</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "PLLM" -->
            <field>
              <name>PLLM</name>
              <description>PLL VCO clock frequency division ratio setting bits</description>
              <msb>3</msb>
              <lsb>0</lsb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <!-- REGISTER "PLL_CTL2" -->
        <register>
          <name>PLL_CTL2</name>
          <description>PLL Control Register 2</description>
          <addressOffset>0x3C</addressOffset>
          <size>8</size>
          <access>read-write</access>
          <resetValue>0x00</resetValue>
          <resetMask>0x3F</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "PLLN" -->
            <field>
              <name>PLLN</name>
              <description>PLL feedback frequency division ratio setting bits</description>
              <msb>5</msb>
              <lsb>0</lsb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <!-- REGISTER "DBWDT_CTL" -->
        <register>
          <name>DBWDT_CTL</name>
          <description>Debug Break Watchdog Timer Control Register</description>
          <addressOffset>0x54</addressOffset>
          <size>8</size>
          <access>read-write</access>
          <resetValue>0x00</resetValue>
          <resetMask>0xA0</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "DPHWBE" -->
            <field>
              <name>DPHWBE</name>
              <description>HW-WDG debug mode break bit</description>
              <msb>7</msb>
              <lsb>7</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "DPSWBE" -->
            <field>
              <name>DPSWBE</name>
              <description>SW-WDG debug mode break bit</description>
              <msb>5</msb>
              <lsb>5</lsb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <!-- REGISTER "INT_ENR" -->
        <register>
          <name>INT_ENR</name>
          <description>Interrupt Enable Register</description>
          <addressOffset>0x60</addressOffset>
          <size>8</size>
          <access>read-write</access>
          <resetValue>0x00</resetValue>
          <resetMask>0x27</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "FCSE" -->
            <field>
              <name>FCSE</name>
              <description>Anomalous frequency detection interrupt enable bit</description>
              <msb>5</msb>
              <lsb>5</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "PCSE" -->
            <field>
              <name>PCSE</name>
              <description>PLL oscillation stabilization wait completion interrupt enable bit</description>
              <msb>2</msb>
              <lsb>2</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "SCSE" -->
            <field>
              <name>SCSE</name>
              <description>Sub clock oscillation stabilization wait completion interrupt enable bit</description>
              <msb>1</msb>
              <lsb>1</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "MCSE" -->
            <field>
              <name>MCSE</name>
              <description>Main clock oscillation stabilization wait completion interrupt enable bit</description>
              <msb>0</msb>
              <lsb>0</lsb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <!-- REGISTER "INT_STR" -->
        <register>
          <name>INT_STR</name>
          <description>Interrupt Status Register</description>
          <addressOffset>0x64</addressOffset>
          <size>8</size>
          <access>read-only</access>
          <resetValue>0x00</resetValue>
          <resetMask>0x27</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "FCSI" -->
            <field>
              <name>FCSI</name>
              <description>Anomalous frequency detection interrupt status bit</description>
              <msb>5</msb>
              <lsb>5</lsb>
              <access>read-only</access>
            </field>
            <!-- FIELD "PCSI" -->
            <field>
              <name>PCSI</name>
              <description>PLL oscillation stabilization wait completion interrupt status bit</description>
              <msb>2</msb>
              <lsb>2</lsb>
              <access>read-only</access>
            </field>
            <!-- FIELD "SCSI" -->
            <field>
              <name>SCSI</name>
              <description>Sub clock oscillation stabilization wait completion interrupt status bit</description>
              <msb>1</msb>
              <lsb>1</lsb>
              <access>read-only</access>
            </field>
            <!-- FIELD "MCSI" -->
            <field>
              <name>MCSI</name>
              <description>Main clock oscillation stabilization wait completion interrupt status bit</description>
              <msb>0</msb>
              <lsb>0</lsb>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <!-- REGISTER "INT_CLR" -->
        <register>
          <name>INT_CLR</name>
          <description>Interrupt Clear Register</description>
          <addressOffset>0x68</addressOffset>
          <size>8</size>
          <access>write-only</access>
          <resetValue>0x00</resetValue>
          <resetMask>0x27</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "FCSC" -->
            <field>
              <name>FCSC</name>
              <description>Anomalous frequency detection interrupt factor clear bit</description>
              <msb>5</msb>
              <lsb>5</lsb>
              <access>write-only</access>
            </field>
            <!-- FIELD "PCSC" -->
            <field>
              <name>PCSC</name>
              <description>PLL oscillation stabilization wait completion interrupt factor clear bit</description>
              <msb>2</msb>
              <lsb>2</lsb>
              <access>write-only</access>
            </field>
            <!-- FIELD "SCSC" -->
            <field>
              <name>SCSC</name>
              <description>Sub clock oscillation stabilization wait completion interrupt factor clear bit</description>
              <msb>1</msb>
              <lsb>1</lsb>
              <access>write-only</access>
            </field>
            <!-- FIELD "MCSC" -->
            <field>
              <name>MCSC</name>
              <description>Main clock oscillation stabilization wait completion interrupt factor clear bit</description>
              <msb>0</msb>
              <lsb>0</lsb>
              <access>write-only</access>
            </field>
          </fields>
        </register>
