TWilmer/s6e2cc/pdl/template/IAR/config/s6e1c3x/svd/S6E1C3.xml
        <!-- REGISTER "PCIS" -->
        <register>
          <name>PCIS</name>
          <description>Priority Conversion Input Selection Register</description>
          <addressOffset>0x20</addressOffset>
          <size>8</size>
          <access>read-write</access>
          <resetValue>0x00</resetValue>
          <resetMask>0xFF</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "P2A" -->
            <field>
              <name>P2A</name>
              <description>Priority level 2 analog input selection</description>
              <msb>7</msb>
              <lsb>3</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "P1A" -->
            <field>
              <name>P1A</name>
              <description>Priority level 1 analog input selection</description>
              <msb>2</msb>
              <lsb>0</lsb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <!-- REGISTER "CMPCR" -->
        <register>
          <name>CMPCR</name>
          <description>A/D Comparison Control Register</description>
          <addressOffset>0x24</addressOffset>
          <size>8</size>
          <access>read-write</access>
          <resetValue>0x00</resetValue>
          <resetMask>0xFF</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "CMPEN" -->
            <field>
              <name>CMPEN</name>
              <description>Conversion result comparison function operation enable bit</description>
              <msb>7</msb>
              <lsb>7</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "CMD1" -->
            <field>
              <name>CMD1</name>
              <description>Comparison mode 1</description>
              <msb>6</msb>
              <lsb>6</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "CMD0" -->
            <field>
              <name>CMD0</name>
              <description>Comparison mode 0</description>
              <msb>5</msb>
              <lsb>5</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "CCH" -->
            <field>
              <name>CCH</name>
              <description>Comparison target analog input channel</description>
              <msb>4</msb>
              <lsb>0</lsb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <!-- REGISTER "CMPD" -->
        <register>
          <name>CMPD</name>
          <description>A/D Comparison Value Setup Register</description>
          <addressOffset>0x26</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x0000</resetValue>
          <resetMask>0xFFC0</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "CMAD" -->
            <field>
              <name>CMAD</name>
              <description>A/D conversion compare value setting bits</description>
              <msb>15</msb>
              <lsb>6</lsb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <!-- REGISTER "ADSS3" -->
        <register>
          <name>ADSS3</name>
          <description>Sampling Time Selection Register 3</description>
          <addressOffset>0x29</addressOffset>
          <size>8</size>
          <access>read-write</access>
          <resetValue>0x00</resetValue>
          <resetMask>0xFF</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "TS31" -->
            <field>
              <name>TS31</name>
              <description>AN31 sampling time selection bit</description>
              <msb>7</msb>
              <lsb>7</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "TS30" -->
            <field>
              <name>TS30</name>
              <description>AN30 sampling time selection bit</description>
              <msb>6</msb>
              <lsb>6</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "TS29" -->
            <field>
              <name>TS29</name>
              <description>AN29 sampling time selection bit</description>
              <msb>5</msb>
              <lsb>5</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "TS28" -->
            <field>
              <name>TS28</name>
              <description>AN28 sampling time selection bit</description>
              <msb>4</msb>
              <lsb>4</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "TS27" -->
            <field>
              <name>TS27</name>
              <description>AN27 sampling time selection bit</description>
              <msb>3</msb>
              <lsb>3</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "TS26" -->
            <field>
              <name>TS26</name>
              <description>AN26 sampling time selection bit</description>
              <msb>2</msb>
              <lsb>2</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "TS25" -->
            <field>
              <name>TS25</name>
              <description>AN25 sampling time selection bit</description>
              <msb>1</msb>
              <lsb>1</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "TS24" -->
            <field>
              <name>TS24</name>
              <description>AN24 sampling time selection bit</description>
              <msb>0</msb>
              <lsb>0</lsb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
