TWilmer/s6e2cc/pdl/template/IAR/config/s6e1c3x/svd/S6E1C3.xml
        <!-- REGISTER "ADSS2" -->
        <register>
          <name>ADSS2</name>
          <description>Sampling Time Selection Register 2</description>
          <addressOffset>0x28</addressOffset>
          <size>8</size>
          <access>read-write</access>
          <resetValue>0x00</resetValue>
          <resetMask>0xFF</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "TS23" -->
            <field>
              <name>TS23</name>
              <description>AN23 sampling time selection bit</description>
              <msb>7</msb>
              <lsb>7</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "TS22" -->
            <field>
              <name>TS22</name>
              <description>AN22 sampling time selection bit</description>
              <msb>6</msb>
              <lsb>6</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "TS21" -->
            <field>
              <name>TS21</name>
              <description>AN21 sampling time selection bit</description>
              <msb>5</msb>
              <lsb>5</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "TS20" -->
            <field>
              <name>TS20</name>
              <description>AN20 sampling time selection bit</description>
              <msb>4</msb>
              <lsb>4</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "TS19" -->
            <field>
              <name>TS19</name>
              <description>AN19 sampling time selection bit</description>
              <msb>3</msb>
              <lsb>3</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "TS18" -->
            <field>
              <name>TS18</name>
              <description>AN18 sampling time selection bit</description>
              <msb>2</msb>
              <lsb>2</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "TS17" -->
            <field>
              <name>TS17</name>
              <description>AN17 sampling time selection bit</description>
              <msb>1</msb>
              <lsb>1</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "TS16" -->
            <field>
              <name>TS16</name>
              <description>AN16 sampling time selection bit</description>
              <msb>0</msb>
              <lsb>0</lsb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <!-- REGISTER "ADSS1" -->
        <register>
          <name>ADSS1</name>
          <description>Sampling Time Selection Register 1</description>
          <addressOffset>0x2D</addressOffset>
          <size>8</size>
          <access>read-write</access>
          <resetValue>0x00</resetValue>
          <resetMask>0xFF</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "TS15" -->
            <field>
              <name>TS15</name>
              <description>AN15 sampling time selection bit</description>
              <msb>7</msb>
              <lsb>7</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "TS14" -->
            <field>
              <name>TS14</name>
              <description>AN14 sampling time selection bit</description>
              <msb>6</msb>
              <lsb>6</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "TS13" -->
            <field>
              <name>TS13</name>
              <description>AN13 sampling time selection bit</description>
              <msb>5</msb>
              <lsb>5</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "TS12" -->
            <field>
              <name>TS12</name>
              <description>AN12 sampling time selection bit</description>
              <msb>4</msb>
              <lsb>4</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "TS11" -->
            <field>
              <name>TS11</name>
              <description>AN11 sampling time selection bit</description>
              <msb>3</msb>
              <lsb>3</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "TS10" -->
            <field>
              <name>TS10</name>
              <description>AN10 sampling time selection bit</description>
              <msb>2</msb>
              <lsb>2</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "TS9" -->
            <field>
              <name>TS9</name>
              <description>AN9 sampling time selection bit</description>
              <msb>1</msb>
              <lsb>1</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "TS8" -->
            <field>
              <name>TS8</name>
              <description>AN8 sampling time selection bit</description>
              <msb>0</msb>
              <lsb>0</lsb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <!-- REGISTER "ADSS0" -->
        <register>
          <name>ADSS0</name>
          <description>Sampling Time Selection Register 0</description>
          <addressOffset>0x2C</addressOffset>
          <size>8</size>
          <access>read-write</access>
          <resetValue>0x00</resetValue>
          <resetMask>0xFF</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "TS7" -->
            <field>
              <name>TS7</name>
              <description>AN7 sampling time selection bit</description>
              <msb>7</msb>
              <lsb>7</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "TS6" -->
            <field>
              <name>TS6</name>
              <description>AN6 sampling time selection bit</description>
              <msb>6</msb>
              <lsb>6</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "TS5" -->
            <field>
              <name>TS5</name>
              <description>AN5 sampling time selection bit</description>
              <msb>5</msb>
              <lsb>5</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "TS4" -->
            <field>
              <name>TS4</name>
              <description>AN4 sampling time selection bit</description>
              <msb>4</msb>
              <lsb>4</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "TS3" -->
            <field>
              <name>TS3</name>
              <description>AN3 sampling time selection bit</description>
              <msb>3</msb>
              <lsb>3</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "TS2" -->
            <field>
              <name>TS2</name>
              <description>AN2 sampling time selection bit</description>
              <msb>2</msb>
              <lsb>2</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "TS1" -->
            <field>
              <name>TS1</name>
              <description>AN1 sampling time selection bit</description>
              <msb>1</msb>
              <lsb>1</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "TS0" -->
            <field>
              <name>TS0</name>
              <description>AN0 sampling time selection bit</description>
              <msb>0</msb>
              <lsb>0</lsb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
