TWilmer/s6e2cc/pdl/template/IAR/config/s6e1c3x/svd/S6E1C3.xml
      </registers>
    </peripheral>
    <!-- PERIPHERAL "LCDC" -->
    <peripheral>
      <name>LCDC</name>
      <description>LCD Controller</description>
      <version>A</version>
      <groupName>LCDC</groupName>
      <baseAddress>0x40032000</baseAddress>
      <!-- ADDRESS BLOCK -->
      <addressBlock>
        <offset>0x0</offset>
        <size>0x3</size>
        <usage>registers</usage>
      </addressBlock>
      <addressBlock>
        <offset>0x4</offset>
        <size>0x4</size>
        <usage>registers</usage>
      </addressBlock>
      <addressBlock>
        <offset>0x8</offset>
        <size>0x1</size>
        <usage>registers</usage>
      </addressBlock>
      <addressBlock>
        <offset>0xC</offset>
        <size>0x4</size>
        <usage>registers</usage>
      </addressBlock>
      <addressBlock>
        <offset>0x10</offset>
        <size>0x1</size>
        <usage>registers</usage>
      </addressBlock>
      <addressBlock>
        <offset>0x14</offset>
        <size>0x2</size>
        <usage>registers</usage>
      </addressBlock>
      <addressBlock>
        <offset>0x18</offset>
        <size>0x2</size>
        <usage>registers</usage>
      </addressBlock>
      <addressBlock>
        <offset>0x1C</offset>
        <size>0x28</size>
        <usage>registers</usage>
      </addressBlock>
      <!-- INTERRUPT "LCDC" -->
      <interrupt>
        <name>LCDC</name>
        <value>27</value>
      </interrupt>
      <!-- REGISTERS -->
      <registers>
        <!-- REGISTER "LCDCC1" -->
        <register>
          <name>LCDCC1</name>
          <description>LCDC Control Register 1</description>
          <addressOffset>0x0</addressOffset>
          <size>8</size>
          <access>read-write</access>
          <resetValue>0x00</resetValue>
          <resetMask>0x7C</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "LCDEN" -->
            <field>
              <name>LCDEN</name>
              <description>Timer mode operation enable bit </description>
              <msb>6</msb>
              <lsb>6</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "VSEL" -->
            <field>
              <name>VSEL</name>
              <description>LCD drive power control bit </description>
              <msb>5</msb>
              <lsb>5</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "MS" -->
            <field>
              <name>MS</name>
              <description>LCD controller display mode selection bits</description>
              <msb>4</msb>
              <lsb>2</lsb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <!-- REGISTER "LCDCC2" -->
        <register>
          <name>LCDCC2</name>
          <description>LCDC Control Register 2</description>
          <addressOffset>0x1</addressOffset>
          <size>8</size>
          <access>read-write</access>
          <resetValue>0x14</resetValue>
          <resetMask>0x3F</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "RSEL" -->
            <field>
              <name>RSEL</name>
              <description>Divider resistor value selection bit</description>
              <msb>5</msb>
              <lsb>5</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "BLS8" -->
            <field>
              <name>BLS8</name>
              <description>8 COM mode bias selection bit </description>
              <msb>4</msb>
              <lsb>4</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "INV" -->
            <field>
              <name>INV</name>
              <description>Reverse display control bit </description>
              <msb>3</msb>
              <lsb>3</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "BK" -->
            <field>
              <name>BK</name>
              <description>Blank display control bit </description>
              <msb>2</msb>
              <lsb>2</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "LCDIEN" -->
            <field>
              <name>LCDIEN</name>
              <description>Interrupt enable bit </description>
              <msb>1</msb>
              <lsb>1</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "LCDIF" -->
            <field>
              <name>LCDIF</name>
              <description>Interrupt request detection bit </description>
              <msb>0</msb>
              <lsb>0</lsb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <!-- REGISTER "LCDCC3" -->
        <register>
          <name>LCDCC3</name>
          <description>LCDC Control Register 3</description>
          <addressOffset>0x2</addressOffset>
          <size>8</size>
          <access>read-write</access>
          <resetValue>0x3E</resetValue>
          <resetMask>0xFE</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "PICTL" -->
            <field>
              <name>PICTL</name>
              <description>I/O port input control bit </description>
              <msb>7</msb>
              <lsb>7</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "BLSEL" -->
            <field>
              <name>BLSEL</name>
              <description>Blink interval selection bit</description>
              <msb>6</msb>
              <lsb>6</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "VE4" -->
            <field>
              <name>VE4</name>
              <description>VV4 selection bit </description>
              <msb>5</msb>
              <lsb>5</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "VE3" -->
            <field>
              <name>VE3</name>
              <description>VV3 selection bit </description>
              <msb>4</msb>
              <lsb>4</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "VE2" -->
            <field>
              <name>VE2</name>
              <description>VV2 selection bit </description>
              <msb>3</msb>
              <lsb>3</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "VE1" -->
            <field>
              <name>VE1</name>
              <description>VV1 selection bit </description>
              <msb>2</msb>
              <lsb>2</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "VE0" -->
            <field>
              <name>VE0</name>
              <description>VV0 selection bit </description>
              <msb>1</msb>
              <lsb>1</lsb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <!-- REGISTER "LCDC_PSR" -->
        <register>
          <name>LCDC_PSR</name>
          <description>LCDC Clock Prescaler Register</description>
          <addressOffset>0x4</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x007FFFFF</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "CLKSEL" -->
            <field>
              <name>CLKSEL</name>
              <description>Source clock selection bit </description>
              <msb>22</msb>
              <lsb>22</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "CLKDIV21" -->
            <field>
              <name>CLKDIV21</name>
              <description>LCDC clock division ratio setting bit 21</description>
              <msb>21</msb>
              <lsb>21</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "CLKDIV20" -->
            <field>
              <name>CLKDIV20</name>
              <description>LCDC clock division ratio setting bit 20</description>
              <msb>20</msb>
              <lsb>20</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "CLKDIV19" -->
            <field>
              <name>CLKDIV19</name>
              <description>LCDC clock division ratio setting bit 19</description>
              <msb>19</msb>
              <lsb>19</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "CLKDIV18" -->
            <field>
              <name>CLKDIV18</name>
              <description>LCDC clock division ratio setting bit 18</description>
              <msb>18</msb>
              <lsb>18</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "CLKDIV17" -->
            <field>
              <name>CLKDIV17</name>
              <description>LCDC clock division ratio setting bit 17</description>
              <msb>17</msb>
              <lsb>17</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "CLKDIV16" -->
            <field>
              <name>CLKDIV16</name>
              <description>LCDC clock division ratio setting bit 16</description>
              <msb>16</msb>
              <lsb>16</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "CLKDIV15" -->
            <field>
              <name>CLKDIV15</name>
              <description>LCDC clock division ratio setting bit 15</description>
              <msb>15</msb>
              <lsb>15</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "CLKDIV14" -->
            <field>
              <name>CLKDIV14</name>
              <description>LCDC clock division ratio setting bit 14</description>
              <msb>14</msb>
              <lsb>14</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "CLKDIV13" -->
            <field>
              <name>CLKDIV13</name>
              <description>LCDC clock division ratio setting bit 13</description>
              <msb>13</msb>
              <lsb>13</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "CLKDIV12" -->
            <field>
              <name>CLKDIV12</name>
              <description>LCDC clock division ratio setting bit 12</description>
              <msb>12</msb>
              <lsb>12</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "CLKDIV11" -->
            <field>
              <name>CLKDIV11</name>
              <description>LCDC clock division ratio setting bit 11</description>
              <msb>11</msb>
              <lsb>11</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "CLKDIV10" -->
            <field>
              <name>CLKDIV10</name>
              <description>LCDC clock division ratio setting bit 10</description>
              <msb>10</msb>
              <lsb>10</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "CLKDIV09" -->
            <field>
              <name>CLKDIV09</name>
              <description>LCDC clock division ratio setting bit 9</description>
              <msb>9</msb>
              <lsb>9</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "CLKDIV08" -->
            <field>
              <name>CLKDIV08</name>
              <description>LCDC clock division ratio setting bit 8</description>
              <msb>8</msb>
              <lsb>8</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "CLKDIV07" -->
            <field>
              <name>CLKDIV07</name>
              <description>LCDC clock division ratio setting bit 7</description>
              <msb>7</msb>
              <lsb>7</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "CLKDIV06" -->
            <field>
              <name>CLKDIV06</name>
              <description>LCDC clock division ratio setting bit 6</description>
              <msb>6</msb>
              <lsb>6</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "CLKDIV05" -->
            <field>
              <name>CLKDIV05</name>
              <description>LCDC clock division ratio setting bit 5</description>
              <msb>5</msb>
              <lsb>5</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "CLKDIV04" -->
            <field>
              <name>CLKDIV04</name>
              <description>LCDC clock division ratio setting bit 4</description>
              <msb>4</msb>
              <lsb>4</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "CLKDIV03" -->
            <field>
              <name>CLKDIV03</name>
              <description>LCDC clock division ratio setting bit 3</description>
              <msb>3</msb>
              <lsb>3</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "CLKDIV02" -->
            <field>
              <name>CLKDIV02</name>
              <description>LCDC clock division ratio setting bit 2</description>
              <msb>2</msb>
              <lsb>2</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "CLKDIV01" -->
            <field>
              <name>CLKDIV01</name>
              <description>LCDC clock division ratio setting bit 1</description>
              <msb>1</msb>
              <lsb>1</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "CLKDIV00" -->
            <field>
              <name>CLKDIV00</name>
              <description>LCDC clock division ratio setting bit 0</description>
              <msb>0</msb>
              <lsb>0</lsb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
