TWilmer/s6e2cc/pdl/template/IAR/config/s6e1c3x/svd/S6E1C3.xml
        <!-- REGISTER "LCDC_SEGEN2" -->
        <register>
          <name>LCDC_SEGEN2</name>
          <description>LCDC SEG Output Enable Register 2</description>
          <addressOffset>0x10</addressOffset>
          <size>8</size>
          <access>read-write</access>
          <resetValue>0x00</resetValue>
          <resetMask>0xFF</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "SEG39" -->
            <field>
              <name>SEG39</name>
              <description>Segment 39</description>
              <msb>7</msb>
              <lsb>7</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "SEG38" -->
            <field>
              <name>SEG38</name>
              <description>Segment 38</description>
              <msb>6</msb>
              <lsb>6</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "SEG37" -->
            <field>
              <name>SEG37</name>
              <description>Segment 37</description>
              <msb>5</msb>
              <lsb>5</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "SEG36" -->
            <field>
              <name>SEG36</name>
              <description>Segment 36</description>
              <msb>4</msb>
              <lsb>4</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "SEG35" -->
            <field>
              <name>SEG35</name>
              <description>Segment 35</description>
              <msb>3</msb>
              <lsb>3</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "SEG34" -->
            <field>
              <name>SEG34</name>
              <description>Segment 34</description>
              <msb>2</msb>
              <lsb>2</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "SEG33" -->
            <field>
              <name>SEG33</name>
              <description>Segment 33</description>
              <msb>1</msb>
              <lsb>1</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "SEG32" -->
            <field>
              <name>SEG32</name>
              <description>Segment 32</description>
              <msb>0</msb>
              <lsb>0</lsb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <!-- REGISTER "LCDC_BLINK" -->
        <register>
          <name>LCDC_BLINK</name>
          <description>LCDC Blink Setting Register</description>
          <addressOffset>0x14</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x0000</resetValue>
          <resetMask>0xFFFF</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "BLD15" -->
            <field>
              <name>BLD15</name>
              <description>Blink operation control bit 15</description>
              <msb>15</msb>
              <lsb>15</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "BLD14" -->
            <field>
              <name>BLD14</name>
              <description>Blink operation control bit 14</description>
              <msb>14</msb>
              <lsb>14</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "BLD13" -->
            <field>
              <name>BLD13</name>
              <description>Blink operation control bit 13</description>
              <msb>13</msb>
              <lsb>13</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "BLD12" -->
            <field>
              <name>BLD12</name>
              <description>Blink operation control bit 12</description>
              <msb>12</msb>
              <lsb>12</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "BLD11" -->
            <field>
              <name>BLD11</name>
              <description>Blink operation control bit 11</description>
              <msb>11</msb>
              <lsb>11</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "BLD10" -->
            <field>
              <name>BLD10</name>
              <description>Blink operation control bit 10</description>
              <msb>10</msb>
              <lsb>10</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "BLD09" -->
            <field>
              <name>BLD09</name>
              <description>Blink operation control bit 9</description>
              <msb>9</msb>
              <lsb>9</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "BLD08" -->
            <field>
              <name>BLD08</name>
              <description>Blink operation control bit 8</description>
              <msb>8</msb>
              <lsb>8</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "BLD07" -->
            <field>
              <name>BLD07</name>
              <description>Blink operation control bit 7</description>
              <msb>7</msb>
              <lsb>7</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "BLD06" -->
            <field>
              <name>BLD06</name>
              <description>Blink operation control bit 6</description>
              <msb>6</msb>
              <lsb>6</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "BLD05" -->
            <field>
              <name>BLD05</name>
              <description>Blink operation control bit 5</description>
              <msb>5</msb>
              <lsb>5</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "BLD04" -->
            <field>
              <name>BLD04</name>
              <description>Blink operation control bit 4</description>
              <msb>4</msb>
              <lsb>4</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "BLD03" -->
            <field>
              <name>BLD03</name>
              <description>Blink operation control bit 3</description>
              <msb>3</msb>
              <lsb>3</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "BLD02" -->
            <field>
              <name>BLD02</name>
              <description>Blink operation control bit 2</description>
              <msb>2</msb>
              <lsb>2</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "BLD01" -->
            <field>
              <name>BLD01</name>
              <description>Blink operation control bit 1</description>
              <msb>1</msb>
              <lsb>1</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "BLD00" -->
            <field>
              <name>BLD00</name>
              <description>Blink operation control bit 0</description>
              <msb>0</msb>
              <lsb>0</lsb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <!-- REGISTER "LCDC_BOOSTER" -->
        <register>
          <name>LCDC_BOOSTER</name>
          <description>LCDC Booster Control Register</description>
          <addressOffset>0x18</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x0E03</resetValue>
          <resetMask>0x3F0F</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "BTRC" -->
            <field>
              <name>BTRC</name>
              <description>Booster coarse setting bits for reference voltage of VV1</description>
              <msb>13</msb>
              <lsb>12</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "BTRF" -->
            <field>
              <name>BTRF</name>
              <description>Booster fine setting bits for reference voltage of VV1</description>
              <msb>11</msb>
              <lsb>8</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "CENSEL" -->
            <field>
              <name>CENSEL</name>
              <description>Booster C1/C0 pin enable control</description>
              <msb>3</msb>
              <lsb>3</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "PSF" -->
            <field>
              <name>PSF</name>
              <description>LCDC power source flag big</description>
              <msb>2</msb>
              <lsb>2</lsb>
              <access>read-only</access>
            </field>
            <!-- FIELD "BSTPD" -->
            <field>
              <name>BSTPD</name>
              <description>Booster Power down control bit</description>
              <msb>1</msb>
              <lsb>1</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "BSTOPT" -->
            <field>
              <name>BSTOPT</name>
              <description>Booster module option</description>
              <msb>0</msb>
              <lsb>0</lsb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
