TWilmer/s6e2cc/pdl/template/IAR/config/s6e1c3x/svd/S6E1C3.xml
        <!-- REGISTER "LCDRAM17" -->
        <register>
          <name>LCDRAM17</name>
          <description>Display Data Memory Register 17</description>
          <addressOffset>0x2D</addressOffset>
          <size>8</size>
          <access>read-write</access>
          <resetValue>0x00</resetValue>
          <resetMask>0xFF</resetMask>
        </register>
        <!-- REGISTER "LCDRAM18" -->
        <register>
          <name>LCDRAM18</name>
          <description>Display Data Memory Register 18</description>
          <addressOffset>0x2E</addressOffset>
          <size>8</size>
          <access>read-write</access>
          <resetValue>0x00</resetValue>
          <resetMask>0xFF</resetMask>
        </register>
        <!-- REGISTER "LCDRAM19" -->
        <register>
          <name>LCDRAM19</name>
          <description>Display Data Memory Register 19</description>
          <addressOffset>0x2F</addressOffset>
          <size>8</size>
          <access>read-write</access>
          <resetValue>0x00</resetValue>
          <resetMask>0xFF</resetMask>
        </register>
        <!-- REGISTER "LCDRAM20" -->
        <register>
          <name>LCDRAM20</name>
          <description>Display Data Memory Register 20</description>
          <addressOffset>0x30</addressOffset>
          <size>8</size>
          <access>read-write</access>
          <resetValue>0x00</resetValue>
          <resetMask>0xFF</resetMask>
        </register>
        <!-- REGISTER "LCDRAM21" -->
        <register>
          <name>LCDRAM21</name>
          <description>Display Data Memory Register 21</description>
          <addressOffset>0x31</addressOffset>
          <size>8</size>
          <access>read-write</access>
          <resetValue>0x00</resetValue>
          <resetMask>0xFF</resetMask>
        </register>
        <!-- REGISTER "LCDRAM22" -->
        <register>
          <name>LCDRAM22</name>
          <description>Display Data Memory Register 22</description>
          <addressOffset>0x32</addressOffset>
          <size>8</size>
          <access>read-write</access>
          <resetValue>0x00</resetValue>
          <resetMask>0xFF</resetMask>
        </register>
        <!-- REGISTER "LCDRAM23" -->
        <register>
          <name>LCDRAM23</name>
          <description>Display Data Memory Register 23</description>
          <addressOffset>0x33</addressOffset>
          <size>8</size>
          <access>read-write</access>
          <resetValue>0x00</resetValue>
          <resetMask>0xFF</resetMask>
        </register>
        <!-- REGISTER "LCDRAM24" -->
        <register>
          <name>LCDRAM24</name>
          <description>Display Data Memory Register 24</description>
          <addressOffset>0x34</addressOffset>
          <size>8</size>
          <access>read-write</access>
          <resetValue>0x00</resetValue>
          <resetMask>0xFF</resetMask>
        </register>
        <!-- REGISTER "LCDRAM25" -->
        <register>
          <name>LCDRAM25</name>
          <description>Display Data Memory Register 25</description>
          <addressOffset>0x35</addressOffset>
          <size>8</size>
          <access>read-write</access>
          <resetValue>0x00</resetValue>
          <resetMask>0xFF</resetMask>
        </register>
        <!-- REGISTER "LCDRAM26" -->
        <register>
          <name>LCDRAM26</name>
          <description>Display Data Memory Register 26</description>
          <addressOffset>0x36</addressOffset>
          <size>8</size>
          <access>read-write</access>
          <resetValue>0x00</resetValue>
          <resetMask>0xFF</resetMask>
        </register>
        <!-- REGISTER "LCDRAM27" -->
        <register>
          <name>LCDRAM27</name>
          <description>Display Data Memory Register 27</description>
          <addressOffset>0x37</addressOffset>
          <size>8</size>
          <access>read-write</access>
          <resetValue>0x00</resetValue>
          <resetMask>0xFF</resetMask>
        </register>
        <!-- REGISTER "LCDRAM28" -->
        <register>
          <name>LCDRAM28</name>
          <description>Display Data Memory Register 28</description>
          <addressOffset>0x38</addressOffset>
          <size>8</size>
          <access>read-write</access>
          <resetValue>0x00</resetValue>
          <resetMask>0xFF</resetMask>
        </register>
        <!-- REGISTER "LCDRAM29" -->
        <register>
          <name>LCDRAM29</name>
          <description>Display Data Memory Register 29</description>
          <addressOffset>0x39</addressOffset>
          <size>8</size>
          <access>read-write</access>
          <resetValue>0x00</resetValue>
          <resetMask>0xFF</resetMask>
        </register>
        <!-- REGISTER "LCDRAM30" -->
        <register>
          <name>LCDRAM30</name>
          <description>Display Data Memory Register 30</description>
          <addressOffset>0x3A</addressOffset>
          <size>8</size>
          <access>read-write</access>
          <resetValue>0x00</resetValue>
          <resetMask>0xFF</resetMask>
        </register>
        <!-- REGISTER "LCDRAM31" -->
        <register>
          <name>LCDRAM31</name>
          <description>Display Data Memory Register 31</description>
          <addressOffset>0x3B</addressOffset>
          <size>8</size>
          <access>read-write</access>
          <resetValue>0x00</resetValue>
          <resetMask>0xFF</resetMask>
        </register>
        <!-- REGISTER "LCDRAM32" -->
        <register>
          <name>LCDRAM32</name>
          <description>Display Data Memory Register 32</description>
          <addressOffset>0x3C</addressOffset>
          <size>8</size>
          <access>read-write</access>
          <resetValue>0x00</resetValue>
          <resetMask>0xFF</resetMask>
        </register>
        <!-- REGISTER "LCDRAM33" -->
        <register>
          <name>LCDRAM33</name>
          <description>Display Data Memory Register 33</description>
          <addressOffset>0x3D</addressOffset>
          <size>8</size>
          <access>read-write</access>
          <resetValue>0x00</resetValue>
          <resetMask>0xFF</resetMask>
        </register>
        <!-- REGISTER "LCDRAM34" -->
        <register>
          <name>LCDRAM34</name>
          <description>Display Data Memory Register 34</description>
          <addressOffset>0x3E</addressOffset>
          <size>8</size>
          <access>read-write</access>
          <resetValue>0x00</resetValue>
          <resetMask>0xFF</resetMask>
        </register>
        <!-- REGISTER "LCDRAM35" -->
        <register>
          <name>LCDRAM35</name>
          <description>Display Data Memory Register 35</description>
          <addressOffset>0x3F</addressOffset>
          <size>8</size>
          <access>read-write</access>
          <resetValue>0x00</resetValue>
          <resetMask>0xFF</resetMask>
        </register>
