TWilmer/s6e2cc/pdl/template/IAR/config/s6e1c3x/svd/S6E1C3.xml
        <!-- REGISTER "FPOER1" -->
        <register>
          <name>FPOER1</name>
          <description>Fast GPIO Output Enable Register 1</description>
          <addressOffset>0x904</addressOffset>
          <size>32</size>
          <access>write-only</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x00007FFF</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "P1E" -->
            <field>
              <name>P1E</name>
              <description>Bit14 of FPOER1</description>
              <msb>14</msb>
              <lsb>14</lsb>
              <access>write-only</access>
            </field>
            <!-- FIELD "P1D" -->
            <field>
              <name>P1D</name>
              <description>Bit13 of FPOER1</description>
              <msb>13</msb>
              <lsb>13</lsb>
              <access>write-only</access>
            </field>
            <!-- FIELD "P1C" -->
            <field>
              <name>P1C</name>
              <description>Bit12 of FPOER1</description>
              <msb>12</msb>
              <lsb>12</lsb>
              <access>write-only</access>
            </field>
            <!-- FIELD "P1B" -->
            <field>
              <name>P1B</name>
              <description>Bit11 of FPOER1</description>
              <msb>11</msb>
              <lsb>11</lsb>
              <access>write-only</access>
            </field>
            <!-- FIELD "P1A" -->
            <field>
              <name>P1A</name>
              <description>Bit10 of FPOER1</description>
              <msb>10</msb>
              <lsb>10</lsb>
              <access>write-only</access>
            </field>
            <!-- FIELD "P19" -->
            <field>
              <name>P19</name>
              <description>Bit9 of FPOER1</description>
              <msb>9</msb>
              <lsb>9</lsb>
              <access>write-only</access>
            </field>
            <!-- FIELD "P18" -->
            <field>
              <name>P18</name>
              <description>Bit8 of FPOER1</description>
              <msb>8</msb>
              <lsb>8</lsb>
              <access>write-only</access>
            </field>
            <!-- FIELD "P17" -->
            <field>
              <name>P17</name>
              <description>Bit7 of FPOER1</description>
              <msb>7</msb>
              <lsb>7</lsb>
              <access>write-only</access>
            </field>
            <!-- FIELD "P16" -->
            <field>
              <name>P16</name>
              <description>Bit6 of FPOER1</description>
              <msb>6</msb>
              <lsb>6</lsb>
              <access>write-only</access>
            </field>
            <!-- FIELD "P15" -->
            <field>
              <name>P15</name>
              <description>Bit5 of FPOER1</description>
              <msb>5</msb>
              <lsb>5</lsb>
              <access>write-only</access>
            </field>
            <!-- FIELD "P14" -->
            <field>
              <name>P14</name>
              <description>Bit4 of FPOER1</description>
              <msb>4</msb>
              <lsb>4</lsb>
              <access>write-only</access>
            </field>
            <!-- FIELD "P13" -->
            <field>
              <name>P13</name>
              <description>Bit3 of FPOER1</description>
              <msb>3</msb>
              <lsb>3</lsb>
              <access>write-only</access>
            </field>
            <!-- FIELD "P12" -->
            <field>
              <name>P12</name>
              <description>Bit2 of FPOER1</description>
              <msb>2</msb>
              <lsb>2</lsb>
              <access>write-only</access>
            </field>
            <!-- FIELD "P11" -->
            <field>
              <name>P11</name>
              <description>Bit1 of FPOER1</description>
              <msb>1</msb>
              <lsb>1</lsb>
              <access>write-only</access>
            </field>
            <!-- FIELD "P10" -->
            <field>
              <name>P10</name>
              <description>Bit0 of FPOER1</description>
              <msb>0</msb>
              <lsb>0</lsb>
              <access>write-only</access>
            </field>
          </fields>
        </register>
        <!-- REGISTER "FPOER2" -->
        <register>
          <name>FPOER2</name>
          <description>Fast GPIO Output Enable Register 2</description>
          <addressOffset>0x908</addressOffset>
          <size>32</size>
          <access>write-only</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x000001FF</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "P28" -->
            <field>
              <name>P28</name>
              <description>Bit8 of FPOER2</description>
              <msb>8</msb>
              <lsb>8</lsb>
              <access>write-only</access>
            </field>
            <!-- FIELD "P27" -->
            <field>
              <name>P27</name>
              <description>Bit7 of FPOER2</description>
              <msb>7</msb>
              <lsb>7</lsb>
              <access>write-only</access>
            </field>
            <!-- FIELD "P26" -->
            <field>
              <name>P26</name>
              <description>Bit6 of FPOER2</description>
              <msb>6</msb>
              <lsb>6</lsb>
              <access>write-only</access>
            </field>
            <!-- FIELD "P25" -->
            <field>
              <name>P25</name>
              <description>Bit5 of FPOER2</description>
              <msb>5</msb>
              <lsb>5</lsb>
              <access>write-only</access>
            </field>
            <!-- FIELD "P24" -->
            <field>
              <name>P24</name>
              <description>Bit4 of FPOER2</description>
              <msb>4</msb>
              <lsb>4</lsb>
              <access>write-only</access>
            </field>
            <!-- FIELD "P23" -->
            <field>
              <name>P23</name>
              <description>Bit3 of FPOER2</description>
              <msb>3</msb>
              <lsb>3</lsb>
              <access>write-only</access>
            </field>
            <!-- FIELD "P22" -->
            <field>
              <name>P22</name>
              <description>Bit2 of FPOER2</description>
              <msb>2</msb>
              <lsb>2</lsb>
              <access>write-only</access>
            </field>
            <!-- FIELD "P21" -->
            <field>
              <name>P21</name>
              <description>Bit1 of FPOER2</description>
              <msb>1</msb>
              <lsb>1</lsb>
              <access>write-only</access>
            </field>
            <!-- FIELD "P20" -->
            <field>
              <name>P20</name>
              <description>Bit0 of FPOER2</description>
              <msb>0</msb>
              <lsb>0</lsb>
              <access>write-only</access>
            </field>
          </fields>
        </register>
        <!-- REGISTER "FPOER3" -->
        <register>
          <name>FPOER3</name>
          <description>Fast GPIO Output Enable Register 3</description>
          <addressOffset>0x90C</addressOffset>
          <size>32</size>
          <access>write-only</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x0000FFFF</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "P3F" -->
            <field>
              <name>P3F</name>
              <description>Bit15 of FPOER3</description>
              <msb>15</msb>
              <lsb>15</lsb>
              <access>write-only</access>
            </field>
            <!-- FIELD "P3E" -->
            <field>
              <name>P3E</name>
              <description>Bit14 of FPOER3</description>
              <msb>14</msb>
              <lsb>14</lsb>
              <access>write-only</access>
            </field>
            <!-- FIELD "P3D" -->
            <field>
              <name>P3D</name>
              <description>Bit13 of FPOER3</description>
              <msb>13</msb>
              <lsb>13</lsb>
              <access>write-only</access>
            </field>
            <!-- FIELD "P3C" -->
            <field>
              <name>P3C</name>
              <description>Bit12 of FPOER3</description>
              <msb>12</msb>
              <lsb>12</lsb>
              <access>write-only</access>
            </field>
            <!-- FIELD "P3B" -->
            <field>
              <name>P3B</name>
              <description>Bit11 of FPOER3</description>
              <msb>11</msb>
              <lsb>11</lsb>
              <access>write-only</access>
            </field>
            <!-- FIELD "P3A" -->
            <field>
              <name>P3A</name>
              <description>Bit10 of FPOER3</description>
              <msb>10</msb>
              <lsb>10</lsb>
              <access>write-only</access>
            </field>
            <!-- FIELD "P39" -->
            <field>
              <name>P39</name>
              <description>Bit9 of FPOER3</description>
              <msb>9</msb>
              <lsb>9</lsb>
              <access>write-only</access>
            </field>
            <!-- FIELD "P38" -->
            <field>
              <name>P38</name>
              <description>Bit8 of FPOER3</description>
              <msb>8</msb>
              <lsb>8</lsb>
              <access>write-only</access>
            </field>
            <!-- FIELD "P37" -->
            <field>
              <name>P37</name>
              <description>Bit7 of FPOER3</description>
              <msb>7</msb>
              <lsb>7</lsb>
              <access>write-only</access>
            </field>
            <!-- FIELD "P36" -->
            <field>
              <name>P36</name>
              <description>Bit6 of FPOER3</description>
              <msb>6</msb>
              <lsb>6</lsb>
              <access>write-only</access>
            </field>
            <!-- FIELD "P35" -->
            <field>
              <name>P35</name>
              <description>Bit5 of FPOER3</description>
              <msb>5</msb>
              <lsb>5</lsb>
              <access>write-only</access>
            </field>
            <!-- FIELD "P34" -->
            <field>
              <name>P34</name>
              <description>Bit4 of FPOER3</description>
              <msb>4</msb>
              <lsb>4</lsb>
              <access>write-only</access>
            </field>
            <!-- FIELD "P33" -->
            <field>
              <name>P33</name>
              <description>Bit3 of FPOER3</description>
              <msb>3</msb>
              <lsb>3</lsb>
              <access>write-only</access>
            </field>
            <!-- FIELD "P32" -->
            <field>
              <name>P32</name>
              <description>Bit2 of FPOER3</description>
              <msb>2</msb>
              <lsb>2</lsb>
              <access>write-only</access>
            </field>
            <!-- FIELD "P31" -->
            <field>
              <name>P31</name>
              <description>Bit1 of FPOER3</description>
              <msb>1</msb>
              <lsb>1</lsb>
              <access>write-only</access>
            </field>
            <!-- FIELD "P30" -->
            <field>
              <name>P30</name>
              <description>Bit0 of FPOER3</description>
              <msb>0</msb>
              <lsb>0</lsb>
              <access>write-only</access>
            </field>
          </fields>
        </register>
        <!-- REGISTER "FPOER4" -->
        <register>
          <name>FPOER4</name>
          <description>Fast GPIO Output Enable Register 4</description>
          <addressOffset>0x910</addressOffset>
          <size>32</size>
          <access>write-only</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x00003FFF</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "P4D" -->
            <field>
              <name>P4D</name>
              <description>Bit13 of FPOER4</description>
              <msb>13</msb>
              <lsb>13</lsb>
              <access>write-only</access>
            </field>
            <!-- FIELD "P4C" -->
            <field>
              <name>P4C</name>
              <description>Bit12 of FPOER4</description>
              <msb>12</msb>
              <lsb>12</lsb>
              <access>write-only</access>
            </field>
            <!-- FIELD "P4B" -->
            <field>
              <name>P4B</name>
              <description>Bit11 of FPOER4</description>
              <msb>11</msb>
              <lsb>11</lsb>
              <access>write-only</access>
            </field>
            <!-- FIELD "P4A" -->
            <field>
              <name>P4A</name>
              <description>Bit10 of FPOER4</description>
              <msb>10</msb>
              <lsb>10</lsb>
              <access>write-only</access>
            </field>
            <!-- FIELD "P49" -->
            <field>
              <name>P49</name>
              <description>Bit9 of FPOER4</description>
              <msb>9</msb>
              <lsb>9</lsb>
              <access>write-only</access>
            </field>
            <!-- FIELD "P48" -->
            <field>
              <name>P48</name>
              <description>Bit8 of FPOER4</description>
              <msb>8</msb>
              <lsb>8</lsb>
              <access>write-only</access>
            </field>
            <!-- FIELD "P47" -->
            <field>
              <name>P47</name>
              <description>Bit7 of FPOER4</description>
              <msb>7</msb>
              <lsb>7</lsb>
              <access>write-only</access>
            </field>
            <!-- FIELD "P46" -->
            <field>
              <name>P46</name>
              <description>Bit6 of FPOER4</description>
              <msb>6</msb>
              <lsb>6</lsb>
              <access>write-only</access>
            </field>
            <!-- FIELD "P45" -->
            <field>
              <name>P45</name>
              <description>Bit5 of FPOER4</description>
              <msb>5</msb>
              <lsb>5</lsb>
              <access>write-only</access>
            </field>
            <!-- FIELD "P44" -->
            <field>
              <name>P44</name>
              <description>Bit4 of FPOER4</description>
              <msb>4</msb>
              <lsb>4</lsb>
              <access>write-only</access>
            </field>
            <!-- FIELD "P43" -->
            <field>
              <name>P43</name>
              <description>Bit3 of FPOER4</description>
              <msb>3</msb>
              <lsb>3</lsb>
              <access>write-only</access>
            </field>
            <!-- FIELD "P42" -->
            <field>
              <name>P42</name>
              <description>Bit2 of FPOER4</description>
              <msb>2</msb>
              <lsb>2</lsb>
              <access>write-only</access>
            </field>
            <!-- FIELD "P41" -->
            <field>
              <name>P41</name>
              <description>Bit1 of FPOER4</description>
              <msb>1</msb>
              <lsb>1</lsb>
              <access>write-only</access>
            </field>
            <!-- FIELD "P40" -->
            <field>
              <name>P40</name>
              <description>Bit0 of FPOER4</description>
              <msb>0</msb>
              <lsb>0</lsb>
              <access>write-only</access>
            </field>
          </fields>
        </register>
        <!-- REGISTER "FPOER5" -->
        <register>
          <name>FPOER5</name>
          <description>Fast GPIO Output Enable Register 5</description>
          <addressOffset>0x914</addressOffset>
          <size>32</size>
          <access>write-only</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x00000FFF</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "P5B" -->
            <field>
              <name>P5B</name>
              <description>Bit11 pf FPOER5</description>
              <msb>11</msb>
              <lsb>11</lsb>
              <access>write-only</access>
            </field>
            <!-- FIELD "P5A" -->
            <field>
              <name>P5A</name>
              <description>Bit10 of FPOER5</description>
              <msb>10</msb>
              <lsb>10</lsb>
              <access>write-only</access>
            </field>
            <!-- FIELD "P59" -->
            <field>
              <name>P59</name>
              <description>Bit9 of FPOER5</description>
              <msb>9</msb>
              <lsb>9</lsb>
              <access>write-only</access>
            </field>
            <!-- FIELD "P58" -->
            <field>
              <name>P58</name>
              <description>Bit8 of FPOER5</description>
              <msb>8</msb>
              <lsb>8</lsb>
              <access>write-only</access>
            </field>
            <!-- FIELD "P57" -->
            <field>
              <name>P57</name>
              <description>Bit7 of FPOER5</description>
              <msb>7</msb>
              <lsb>7</lsb>
              <access>write-only</access>
            </field>
            <!-- FIELD "P56" -->
            <field>
              <name>P56</name>
              <description>Bit6 of FPOER5</description>
              <msb>6</msb>
              <lsb>6</lsb>
              <access>write-only</access>
            </field>
            <!-- FIELD "P55" -->
            <field>
              <name>P55</name>
              <description>Bit5 of FPOER5</description>
              <msb>5</msb>
              <lsb>5</lsb>
              <access>write-only</access>
            </field>
            <!-- FIELD "P54" -->
            <field>
              <name>P54</name>
              <description>Bit4 of FPOER5</description>
              <msb>4</msb>
              <lsb>4</lsb>
              <access>write-only</access>
            </field>
            <!-- FIELD "P53" -->
            <field>
              <name>P53</name>
              <description>Bit3 of FPOER5</description>
              <msb>3</msb>
              <lsb>3</lsb>
              <access>write-only</access>
            </field>
            <!-- FIELD "P52" -->
            <field>
              <name>P52</name>
              <description>Bit2 of FPOER5</description>
              <msb>2</msb>
              <lsb>2</lsb>
              <access>write-only</access>
            </field>
            <!-- FIELD "P51" -->
            <field>
              <name>P51</name>
              <description>Bit1 of FPOER5</description>
              <msb>1</msb>
              <lsb>1</lsb>
              <access>write-only</access>
            </field>
            <!-- FIELD "P50" -->
            <field>
              <name>P50</name>
              <description>Bit0 of FPOER5</description>
              <msb>0</msb>
              <lsb>0</lsb>
              <access>write-only</access>
            </field>
          </fields>
        </register>
