TWilmer/s6e2cc/pdl/template/IAR/config/s6e1c3x/svd/S6E1C3.xml
      </registers>
    </peripheral>
    <!-- PERIPHERAL "ICC0" -->
    <peripheral>
      <name>ICC0</name>
      <description>IC-Card Interface 0 Registers</description>
      <version>A</version>
      <groupName>ICC0</groupName>
      <baseAddress>0x4003C900</baseAddress>
      <!-- ADDRESS BLOCK -->
      <addressBlock>
        <offset>0x0</offset>
        <size>0x2</size>
        <usage>registers</usage>
      </addressBlock>
      <addressBlock>
        <offset>0x4</offset>
        <size>0x2</size>
        <usage>registers</usage>
      </addressBlock>
      <addressBlock>
        <offset>0x8</offset>
        <size>0x2</size>
        <usage>registers</usage>
      </addressBlock>
      <addressBlock>
        <offset>0xC</offset>
        <size>0x2</size>
        <usage>registers</usage>
      </addressBlock>
      <addressBlock>
        <offset>0x10</offset>
        <size>0x2</size>
        <usage>registers</usage>
      </addressBlock>
      <addressBlock>
        <offset>0x14</offset>
        <size>0x2</size>
        <usage>registers</usage>
      </addressBlock>
      <addressBlock>
        <offset>0x18</offset>
        <size>0x2</size>
        <usage>registers</usage>
      </addressBlock>
      <addressBlock>
        <offset>0x1C</offset>
        <size>0x2</size>
        <usage>registers</usage>
      </addressBlock>
      <addressBlock>
        <offset>0x20</offset>
        <size>0x2</size>
        <usage>registers</usage>
      </addressBlock>
      <addressBlock>
        <offset>0x24</offset>
        <size>0x2</size>
        <usage>registers</usage>
      </addressBlock>
      <addressBlock>
        <offset>0x28</offset>
        <size>0x2</size>
        <usage>registers</usage>
      </addressBlock>
      <addressBlock>
        <offset>0x2C</offset>
        <size>0x2</size>
        <usage>registers</usage>
      </addressBlock>
      <addressBlock>
        <offset>0x30</offset>
        <size>0x2</size>
        <usage>registers</usage>
      </addressBlock>
      <addressBlock>
        <offset>0x34</offset>
        <size>0x2</size>
        <usage>registers</usage>
      </addressBlock>
      <addressBlock>
        <offset>0x38</offset>
        <size>0x2</size>
        <usage>registers</usage>
      </addressBlock>
      <addressBlock>
        <offset>0x3C</offset>
        <size>0x2</size>
        <usage>registers</usage>
      </addressBlock>
      <addressBlock>
        <offset>0x40</offset>
        <size>0x2</size>
        <usage>registers</usage>
      </addressBlock>
      <!-- INTERRUPT "PPG_DSTC_ICC0_CEC0" -->
      <interrupt>
        <name>PPG_DSTC_ICC0_CEC0</name>
        <value>23</value>
      </interrupt>
      <!-- REGISTERS -->
      <registers>
        <!-- REGISTER "GLOBALCONTROL1" -->
        <register>
          <name>GLOBALCONTROL1</name>
          <description>IC-Card Interface 0 Registers</description>
          <addressOffset>0x0</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x0800</resetValue>
          <resetMask>0x7FFF</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "Idtsc" -->
            <field>
              <name>Idtsc</name>
              <description>Idle timer clock select bit</description>
              <msb>14</msb>
              <lsb>14</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "Stidt" -->
            <field>
              <name>Stidt</name>
              <description>Start idle timer bit</description>
              <msb>13</msb>
              <lsb>13</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "Guaen" -->
            <field>
              <name>Guaen</name>
              <description>Guard timer enable bit</description>
              <msb>12</msb>
              <lsb>12</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "Resnd" -->
            <field>
              <name>Resnd</name>
              <description>Transmiter and receiver resend function enable bit</description>
              <msb>11</msb>
              <lsb>11</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "Ckmod" -->
            <field>
              <name>Ckmod</name>
              <description>Clock generation mode select bit</description>
              <msb>10</msb>
              <lsb>10</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "Iomod" -->
            <field>
              <name>Iomod</name>
              <description>Data generation mode select bit</description>
              <msb>9</msb>
              <lsb>9</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "Maskitexp" -->
            <field>
              <name>Maskitexp</name>
              <description>Idle timer expired interrupt enable bit</description>
              <msb>8</msb>
              <lsb>8</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "Maskcaevent" -->
            <field>
              <name>Maskcaevent</name>
              <description>Card event detect interrupt enable bit</description>
              <msb>7</msb>
              <lsb>7</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "Masksti" -->
            <field>
              <name>Masksti</name>
              <description>Start bit detect interrupt enable bit</description>
              <msb>6</msb>
              <lsb>6</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "Masktxemp" -->
            <field>
              <name>Masktxemp</name>
              <description>Transmit data register empty interrupt enable bit</description>
              <msb>5</msb>
              <lsb>5</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "Maskrxful" -->
            <field>
              <name>Maskrxful</name>
              <description>Receive data register full interrupt enable bit</description>
              <msb>4</msb>
              <lsb>4</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "Mode8n1" -->
            <field>
              <name>Mode8n1</name>
              <description>Clock generation mode select bit</description>
              <msb>3</msb>
              <lsb>3</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "Frm1" -->
            <field>
              <name>Frm1</name>
              <description>Data frame coding style select bit</description>
              <msb>2</msb>
              <lsb>2</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "Frm0" -->
            <field>
              <name>Frm0</name>
              <description>Clock generation mode select bit</description>
              <msb>1</msb>
              <lsb>1</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "Parity" -->
            <field>
              <name>Parity</name>
              <description>Odd/Even parity select bit</description>
              <msb>0</msb>
              <lsb>0</lsb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <!-- REGISTER "STATUS" -->
        <register>
          <name>STATUS</name>
          <description>Status Register</description>
          <addressOffset>0x4</addressOffset>
          <size>16</size>
          <access>read-only</access>
          <resetValue>0x0001</resetValue>
          <resetMask>0x3FFF</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "RxResend" -->
            <field>
              <name>RxResend</name>
              <description>Receiver resend flag bit</description>
              <msb>13</msb>
              <lsb>13</lsb>
              <access>read-only</access>
            </field>
            <!-- FIELD "TxResend" -->
            <field>
              <name>TxResend</name>
              <description>Transmitter resend flag bit</description>
              <msb>12</msb>
              <lsb>12</lsb>
              <access>read-only</access>
            </field>
            <!-- FIELD "RxStartErr" -->
            <field>
              <name>RxStartErr</name>
              <description>Received start bit error flag bit</description>
              <msb>11</msb>
              <lsb>11</lsb>
              <access>read-only</access>
            </field>
            <!-- FIELD "WrFifoEmp" -->
            <field>
              <name>WrFifoEmp</name>
              <description>Write FIFO empty flag bit</description>
              <msb>10</msb>
              <lsb>10</lsb>
              <access>read-only</access>
            </field>
            <!-- FIELD "RdFifoFul" -->
            <field>
              <name>RdFifoFul</name>
              <description>Read FIFO full flag bit</description>
              <msb>9</msb>
              <lsb>9</lsb>
              <access>read-only</access>
            </field>
            <!-- FIELD "RdFifoOvr" -->
            <field>
              <name>RdFifoOvr</name>
              <description>Read FIFO overflow flag</description>
              <msb>8</msb>
              <lsb>8</lsb>
              <access>read-only</access>
            </field>
            <!-- FIELD "Idtrun" -->
            <field>
              <name>Idtrun</name>
              <description>Idle timer running flag</description>
              <msb>7</msb>
              <lsb>7</lsb>
              <access>read-only</access>
            </field>
            <!-- FIELD "Recofl" -->
            <field>
              <name>Recofl</name>
              <description>Received data register overflow flag</description>
              <msb>6</msb>
              <lsb>6</lsb>
              <access>read-only</access>
            </field>
            <!-- FIELD "CardEvent" -->
            <field>
              <name>CardEvent</name>
              <description>Card event flag</description>
              <msb>5</msb>
              <lsb>5</lsb>
              <access>read-only</access>
            </field>
            <!-- FIELD "CardDetect" -->
            <field>
              <name>CardDetect</name>
              <description>Level on ICx_CIN input pin</description>
              <msb>4</msb>
              <lsb>4</lsb>
              <access>read-only</access>
            </field>
            <!-- FIELD "Txact" -->
            <field>
              <name>Txact</name>
              <description>Transmitter status flag</description>
              <msb>3</msb>
              <lsb>3</lsb>
              <access>read-only</access>
            </field>
            <!-- FIELD "Rxact" -->
            <field>
              <name>Rxact</name>
              <description>Receiver status flag</description>
              <msb>2</msb>
              <lsb>2</lsb>
              <access>read-only</access>
            </field>
            <!-- FIELD "Rxful" -->
            <field>
              <name>Rxful</name>
              <description>Received data register status flag</description>
              <msb>1</msb>
              <lsb>1</lsb>
              <access>read-only</access>
            </field>
            <!-- FIELD "Txemp" -->
            <field>
              <name>Txemp</name>
              <description>Transmit data register status flag</description>
              <msb>0</msb>
              <lsb>0</lsb>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <!-- REGISTER "PORTCONTROL" -->
        <register>
          <name>PORTCONTROL</name>
          <description>Port Control Register</description>
          <addressOffset>0x8</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x0000</resetValue>
          <resetMask>0xF3D5</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "VpenOutEn" -->
            <field>
              <name>VpenOutEn</name>
              <description>ICx_VPEN output enable bit</description>
              <msb>15</msb>
              <lsb>15</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "VccOutEn" -->
            <field>
              <name>VccOutEn</name>
              <description>ICx_VCC output enable bit</description>
              <msb>14</msb>
              <lsb>14</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "RstOutEn" -->
            <field>
              <name>RstOutEn</name>
              <description>ICx_RST output enable bit</description>
              <msb>13</msb>
              <lsb>13</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "ClkOutEn" -->
            <field>
              <name>ClkOutEn</name>
              <description>ICx_CLK output enable bit</description>
              <msb>12</msb>
              <lsb>12</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "Vpen" -->
            <field>
              <name>Vpen</name>
              <description>ICx_VPEN output value</description>
              <msb>9</msb>
              <lsb>9</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "Vccen" -->
            <field>
              <name>Vccen</name>
              <description>ICx_VCC output value</description>
              <msb>8</msb>
              <lsb>8</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "Rst" -->
            <field>
              <name>Rst</name>
              <description>ICx_RST output value</description>
              <msb>7</msb>
              <lsb>7</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "Clkpt" -->
            <field>
              <name>Clkpt</name>
              <description>ICx_CLK output value</description>
              <msb>6</msb>
              <lsb>6</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "Io1en" -->
            <field>
              <name>Io1en</name>
              <description>ICx_DATA output enable control bit</description>
              <msb>4</msb>
              <lsb>4</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "Io1" -->
            <field>
              <name>Io1</name>
              <description>Level on ICx_DATA pin</description>
              <msb>2</msb>
              <lsb>2</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "Trimod" -->
            <field>
              <name>Trimod</name>
              <description>ICx_DATA output enable generation mode select bit</description>
              <msb>0</msb>
              <lsb>0</lsb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <!-- REGISTER "DATA" -->
        <register>
          <name>DATA</name>
          <description>Data Register</description>
          <addressOffset>0xC</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x0000</resetValue>
          <resetMask>0x01FF</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "Data" -->
            <field>
              <name>Data</name>
              <description>Transmit/Received data</description>
              <msb>8</msb>
              <lsb>0</lsb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <!-- REGISTER "CARDCLOCK" -->
        <register>
          <name>CARDCLOCK</name>
          <description>Card Clock Frequency Register</description>
          <addressOffset>0x10</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x0000</resetValue>
          <resetMask>0xFFFF</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "ClkDivider" -->
            <field>
              <name>ClkDivider</name>
              <description>Card clock frequency divider</description>
              <msb>15</msb>
              <lsb>0</lsb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
