TWilmer/s6e2cc/pdl/template/IAR/config/s6e1c3x/svd/S6E1C3.xml
        <!-- REGISTER "BAUDRATE" -->
        <register>
          <name>BAUDRATE</name>
          <description>Baud Rate Register</description>
          <addressOffset>0x14</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x0174</resetValue>
          <resetMask>0xFFFF</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "LittleStep" -->
            <field>
              <name>LittleStep</name>
              <description>Little step bit for baud rate</description>
              <msb>15</msb>
              <lsb>15</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "Brreg" -->
            <field>
              <name>Brreg</name>
              <description>Baud rate register bits</description>
              <msb>14</msb>
              <lsb>0</lsb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <!-- REGISTER "GUARDTIMER" -->
        <register>
          <name>GUARDTIMER</name>
          <description>Guard Timer Register</description>
          <addressOffset>0x18</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x0000</resetValue>
          <resetMask>0x00FF</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "Gtreg" -->
            <field>
              <name>Gtreg</name>
              <description>Guard time in ETUs</description>
              <msb>7</msb>
              <lsb>0</lsb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <!-- REGISTER "IDLETIMER" -->
        <register>
          <name>IDLETIMER</name>
          <description>Idle Timer Register</description>
          <addressOffset>0x1C</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x0000</resetValue>
          <resetMask>0xFFFF</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "Idtreg" -->
            <field>
              <name>Idtreg</name>
              <description>Reload value for idle timer</description>
              <msb>15</msb>
              <lsb>0</lsb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <!-- REGISTER "GLOBALCONTROL2" -->
        <register>
          <name>GLOBALCONTROL2</name>
          <description>Global Control Register 2</description>
          <addressOffset>0x20</addressOffset>
          <size>16</size>
          <access>write-only</access>
          <resetValue>0x0008</resetValue>
          <resetMask>0x000B</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "IccDisable" -->
            <field>
              <name>IccDisable</name>
              <description>ICC disable/enable bit</description>
              <msb>3</msb>
              <lsb>3</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "InvDataOut" -->
            <field>
              <name>InvDataOut</name>
              <description>Output inversion enable bit</description>
              <msb>1</msb>
              <lsb>1</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "Rx8n1" -->
            <field>
              <name>Rx8n1</name>
              <description>Serial data output enable bit</description>
              <msb>0</msb>
              <lsb>0</lsb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <!-- REGISTER "DATA_FIFO" -->
        <register>
          <name>DATA_FIFO</name>
          <description>FIFO Access Register</description>
          <addressOffset>0x24</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x0000</resetValue>
          <resetMask>0x01FF</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "Data" -->
            <field>
              <name>Data</name>
              <description>Transmit/Received data</description>
              <msb>8</msb>
              <lsb>0</lsb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <!-- REGISTER "FIFO_LEVEL_READ" -->
        <register>
          <name>FIFO_LEVEL_READ</name>
          <description>Read FIFO Level Register</description>
          <addressOffset>0x28</addressOffset>
          <size>16</size>
          <access>read-only</access>
          <resetValue>0x0000</resetValue>
          <resetMask>0xFFFF</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "FifoRdLevel" -->
            <field>
              <name>FifoRdLevel</name>
              <description>Read FIFO level</description>
              <msb>15</msb>
              <lsb>0</lsb>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <!-- REGISTER "FIFO_LEVEL_WRITE" -->
        <register>
          <name>FIFO_LEVEL_WRITE</name>
          <description>Write FIFO Level Register</description>
          <addressOffset>0x2C</addressOffset>
          <size>16</size>
          <access>read-only</access>
          <resetValue>0x0000</resetValue>
          <resetMask>0xFFFF</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "FifoWrLevel" -->
            <field>
              <name>FifoWrLevel</name>
              <description>Read FIFO level</description>
              <msb>15</msb>
              <lsb>0</lsb>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <!-- REGISTER "FIFO_MODE" -->
        <register>
          <name>FIFO_MODE</name>
          <description>FIFO Mode Register</description>
          <addressOffset>0x30</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x0000</resetValue>
          <resetMask>0xFF0F</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "RdFifoLevel" -->
            <field>
              <name>RdFifoLevel</name>
              <description>Read FIFO level</description>
              <msb>15</msb>
              <lsb>12</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "WrFifoLevel" -->
            <field>
              <name>WrFifoLevel</name>
              <description>Write FIFO level</description>
              <msb>11</msb>
              <lsb>8</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "RdFifoIrqEn" -->
            <field>
              <name>RdFifoIrqEn</name>
              <description>Read FIFO full interrupt enable bit</description>
              <msb>3</msb>
              <lsb>3</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "WrFifoIrqEn" -->
            <field>
              <name>WrFifoIrqEn</name>
              <description>Write FIFO empty interrupt enable bit</description>
              <msb>2</msb>
              <lsb>2</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "RdFifoOvrIrqEn" -->
            <field>
              <name>RdFifoOvrIrqEn</name>
              <description>Read FIFO overflow interrupt enable bit</description>
              <msb>1</msb>
              <lsb>1</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "FifoEn" -->
            <field>
              <name>FifoEn</name>
              <description>FIFO enable bit</description>
              <msb>0</msb>
              <lsb>0</lsb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <!-- REGISTER "FIFO_CLEAR_MSB_WRITE" -->
        <register>
          <name>FIFO_CLEAR_MSB_WRITE</name>
          <description>Write FIFO Clear Register</description>
          <addressOffset>0x34</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x0000</resetValue>
          <resetMask>0x0001</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "ClrWrFifo" -->
            <field>
              <name>ClrWrFifo</name>
              <description>Write FIFO clear bit</description>
              <msb>0</msb>
              <lsb>0</lsb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <!-- REGISTER "FIFO_CLEAR_MSB_READ" -->
        <register>
          <name>FIFO_CLEAR_MSB_READ</name>
          <description>Read FIFO Clear Register</description>
          <addressOffset>0x38</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x0000</resetValue>
          <resetMask>0x0001</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "ClrRdFifo" -->
            <field>
              <name>ClrRdFifo</name>
              <description>Read FIFO clear bit</description>
              <msb>0</msb>
              <lsb>0</lsb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <!-- REGISTER "IRQ_STATUS" -->
        <register>
          <name>IRQ_STATUS</name>
          <description>Interrupt Status Register</description>
          <addressOffset>0x40</addressOffset>
          <size>16</size>
          <access>read-only</access>
          <resetValue>0x0000</resetValue>
          <resetMask>0x00FF</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "RxfulIrq" -->
            <field>
              <name>RxfulIrq</name>
              <description>Received data register full interrupt flag bit</description>
              <msb>7</msb>
              <lsb>7</lsb>
              <access>read-only</access>
            </field>
            <!-- FIELD "TxempIrq" -->
            <field>
              <name>TxempIrq</name>
              <description>Transmit data register empty interrupt flag bit</description>
              <msb>6</msb>
              <lsb>6</lsb>
              <access>read-only</access>
            </field>
            <!-- FIELD "RxstbiIrq" -->
            <field>
              <name>RxstbiIrq</name>
              <description>Received start bit interrupt flag bit</description>
              <msb>5</msb>
              <lsb>5</lsb>
              <access>read-only</access>
            </field>
            <!-- FIELD "CardEventIrq" -->
            <field>
              <name>CardEventIrq</name>
              <description>Card event interrupt flag bit</description>
              <msb>4</msb>
              <lsb>4</lsb>
              <access>read-only</access>
            </field>
            <!-- FIELD "Idtexp" -->
            <field>
              <name>Idtexp</name>
              <description>Idle timer expired interrupt flag bit</description>
              <msb>3</msb>
              <lsb>3</lsb>
              <access>read-only</access>
            </field>
            <!-- FIELD "RdFifoIrq" -->
            <field>
              <name>RdFifoIrq</name>
              <description>Read FIFO full interrupt flag bit</description>
              <msb>2</msb>
              <lsb>2</lsb>
              <access>read-only</access>
            </field>
            <!-- FIELD "WrFifoIrq" -->
            <field>
              <name>WrFifoIrq</name>
              <description>Write FIFO empty interrupt flag bit</description>
              <msb>1</msb>
              <lsb>1</lsb>
              <access>read-only</access>
            </field>
            <!-- FIELD "RdFifoOvrIrq" -->
            <field>
              <name>RdFifoOvrIrq</name>
              <description>Read FIFO overflow interrupt flag bit</description>
              <msb>0</msb>
              <lsb>0</lsb>
              <access>read-only</access>
            </field>
          </fields>
        </register>
