TWilmer/s6e2cc/pdl/template/IAR/config/s6e1c3x/svd/S6E1C3.xml
        <!-- REGISTER "FPDIR5" -->
        <register>
          <name>FPDIR5</name>
          <description>Fast GPIO Input Data Register 5</description>
          <addressOffset>0x14</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x00000FFF</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "P5B" -->
            <field>
              <name>P5B</name>
              <description>Bit11 of FPDIR5</description>
              <msb>11</msb>
              <lsb>11</lsb>
              <access>read-only</access>
            </field>
            <!-- FIELD "P5A" -->
            <field>
              <name>P5A</name>
              <description>Bit10 of FPDIR5</description>
              <msb>10</msb>
              <lsb>10</lsb>
              <access>read-only</access>
            </field>
            <!-- FIELD "P59" -->
            <field>
              <name>P59</name>
              <description>Bit9 of FPDIR5</description>
              <msb>9</msb>
              <lsb>9</lsb>
              <access>read-only</access>
            </field>
            <!-- FIELD "P58" -->
            <field>
              <name>P58</name>
              <description>Bit8 of FPDIR5</description>
              <msb>8</msb>
              <lsb>8</lsb>
              <access>read-only</access>
            </field>
            <!-- FIELD "P57" -->
            <field>
              <name>P57</name>
              <description>Bit7 of FPDIR5</description>
              <msb>7</msb>
              <lsb>7</lsb>
              <access>read-only</access>
            </field>
            <!-- FIELD "P56" -->
            <field>
              <name>P56</name>
              <description>Bit6 of FPDIR5</description>
              <msb>6</msb>
              <lsb>6</lsb>
              <access>read-only</access>
            </field>
            <!-- FIELD "P55" -->
            <field>
              <name>P55</name>
              <description>Bit5 of FPDIR5</description>
              <msb>5</msb>
              <lsb>5</lsb>
              <access>read-only</access>
            </field>
            <!-- FIELD "P54" -->
            <field>
              <name>P54</name>
              <description>Bit4 of FPDIR5</description>
              <msb>4</msb>
              <lsb>4</lsb>
              <access>read-only</access>
            </field>
            <!-- FIELD "P53" -->
            <field>
              <name>P53</name>
              <description>Bit3 of FPDIR5</description>
              <msb>3</msb>
              <lsb>3</lsb>
              <access>read-only</access>
            </field>
            <!-- FIELD "P52" -->
            <field>
              <name>P52</name>
              <description>Bit2 of FPDIR5</description>
              <msb>2</msb>
              <lsb>2</lsb>
              <access>read-only</access>
            </field>
            <!-- FIELD "P51" -->
            <field>
              <name>P51</name>
              <description>Bit1 of FPDIR5</description>
              <msb>1</msb>
              <lsb>1</lsb>
              <access>read-only</access>
            </field>
            <!-- FIELD "P50" -->
            <field>
              <name>P50</name>
              <description>Bit0 of FPDIR5</description>
              <msb>0</msb>
              <lsb>0</lsb>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <!-- REGISTER "FPDIR6" -->
        <register>
          <name>FPDIR6</name>
          <description>Fast GPIO Input Data Register 6</description>
          <addressOffset>0x18</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x000001FF</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "P68" -->
            <field>
              <name>P68</name>
              <description>Bit8 of FPDIR6</description>
              <msb>8</msb>
              <lsb>8</lsb>
              <access>read-only</access>
            </field>
            <!-- FIELD "P67" -->
            <field>
              <name>P67</name>
              <description>Bit7 of FPDIR6</description>
              <msb>7</msb>
              <lsb>7</lsb>
              <access>read-only</access>
            </field>
            <!-- FIELD "P66" -->
            <field>
              <name>P66</name>
              <description>Bit6 of FPDIR6</description>
              <msb>6</msb>
              <lsb>6</lsb>
              <access>read-only</access>
            </field>
            <!-- FIELD "P65" -->
            <field>
              <name>P65</name>
              <description>Bit5 of FPDIR6</description>
              <msb>5</msb>
              <lsb>5</lsb>
              <access>read-only</access>
            </field>
            <!-- FIELD "P64" -->
            <field>
              <name>P64</name>
              <description>Bit4 of FPDIR6</description>
              <msb>4</msb>
              <lsb>4</lsb>
              <access>read-only</access>
            </field>
            <!-- FIELD "P63" -->
            <field>
              <name>P63</name>
              <description>Bit3 of FPDIR6</description>
              <msb>3</msb>
              <lsb>3</lsb>
              <access>read-only</access>
            </field>
            <!-- FIELD "P62" -->
            <field>
              <name>P62</name>
              <description>Bit2 of FPDIR6</description>
              <msb>2</msb>
              <lsb>2</lsb>
              <access>read-only</access>
            </field>
            <!-- FIELD "P61" -->
            <field>
              <name>P61</name>
              <description>Bit1 of FPDIR6</description>
              <msb>1</msb>
              <lsb>1</lsb>
              <access>read-only</access>
            </field>
            <!-- FIELD "P60" -->
            <field>
              <name>P60</name>
              <description>Bit0 of FPDIR6</description>
              <msb>0</msb>
              <lsb>0</lsb>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <!-- REGISTER "FPDIR7" -->
        <register>
          <name>FPDIR7</name>
          <description>Fast GPIO Input Data Register 7</description>
          <addressOffset>0x1C</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x0000001F</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "P74" -->
            <field>
              <name>P74</name>
              <description>Bit4 of FPDIR7</description>
              <msb>4</msb>
              <lsb>4</lsb>
              <access>read-only</access>
            </field>
            <!-- FIELD "P73" -->
            <field>
              <name>P73</name>
              <description>Bit3 of FPDIR7</description>
              <msb>3</msb>
              <lsb>3</lsb>
              <access>read-only</access>
            </field>
            <!-- FIELD "P72" -->
            <field>
              <name>P72</name>
              <description>Bit2 of FPDIR7</description>
              <msb>2</msb>
              <lsb>2</lsb>
              <access>read-only</access>
            </field>
            <!-- FIELD "P71" -->
            <field>
              <name>P71</name>
              <description>Bit1 of FPDIR7</description>
              <msb>1</msb>
              <lsb>1</lsb>
              <access>read-only</access>
            </field>
            <!-- FIELD "P70" -->
            <field>
              <name>P70</name>
              <description>Bit0 of FPDIR7</description>
              <msb>0</msb>
              <lsb>0</lsb>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <!-- REGISTER "FPDIR8" -->
        <register>
          <name>FPDIR8</name>
          <description>Fast GPIO Input Data Register 8</description>
          <addressOffset>0x20</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x00000007</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "P82" -->
            <field>
              <name>P82</name>
              <description>Bit2 of FPDIR8</description>
              <msb>2</msb>
              <lsb>2</lsb>
              <access>read-only</access>
            </field>
            <!-- FIELD "P81" -->
            <field>
              <name>P81</name>
              <description>Bit1 of FPDIR8</description>
              <msb>1</msb>
              <lsb>1</lsb>
              <access>read-only</access>
            </field>
            <!-- FIELD "P80" -->
            <field>
              <name>P80</name>
              <description>Bit0 of FPDIR8</description>
              <msb>0</msb>
              <lsb>0</lsb>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <!-- REGISTER "FPDIRE" -->
        <register>
          <name>FPDIRE</name>
          <description>Fast GPIO Input Data Register E</description>
          <addressOffset>0x38</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x0000000D</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "PE3" -->
            <field>
              <name>PE3</name>
              <description>Bit3 of FPDIRE</description>
              <msb>3</msb>
              <lsb>3</lsb>
              <access>read-only</access>
            </field>
            <!-- FIELD "PE2" -->
            <field>
              <name>PE2</name>
              <description>Bit2 of FPDIRE</description>
              <msb>2</msb>
              <lsb>2</lsb>
              <access>read-only</access>
            </field>
            <!-- FIELD "PE0" -->
            <field>
              <name>PE0</name>
              <description>Bit0 of FPDIRE</description>
              <msb>0</msb>
              <lsb>0</lsb>
              <access>read-only</access>
            </field>
          </fields>
        </register>
