TWilmer/s6e2cc/pdl/template/IAR/config/s6e1c3x/svd/S6E1C3.xml
        <!-- REGISTER "FPDOR0" -->
        <register>
          <name>FPDOR0</name>
          <description>Fast GPIO Output Data Register 0</description>
          <addressOffset>0x40</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x0000FFFF</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "P0F" -->
            <field>
              <name>P0F</name>
              <description>Bit15 of FPDOR0</description>
              <msb>15</msb>
              <lsb>15</lsb>
              <access>read-only</access>
            </field>
            <!-- FIELD "P0E" -->
            <field>
              <name>P0E</name>
              <description>Bit14 of FPDOR0</description>
              <msb>14</msb>
              <lsb>14</lsb>
              <access>read-only</access>
            </field>
            <!-- FIELD "P0D" -->
            <field>
              <name>P0D</name>
              <description>Bit13 of FPDOR0</description>
              <msb>13</msb>
              <lsb>13</lsb>
              <access>read-only</access>
            </field>
            <!-- FIELD "P0C" -->
            <field>
              <name>P0C</name>
              <description>Bit12 of FPDOR0</description>
              <msb>12</msb>
              <lsb>12</lsb>
              <access>read-only</access>
            </field>
            <!-- FIELD "P0B" -->
            <field>
              <name>P0B</name>
              <description>Bit11 of FPDOR0</description>
              <msb>11</msb>
              <lsb>11</lsb>
              <access>read-only</access>
            </field>
            <!-- FIELD "P0A" -->
            <field>
              <name>P0A</name>
              <description>Bit10 of FPDOR0</description>
              <msb>10</msb>
              <lsb>10</lsb>
              <access>read-only</access>
            </field>
            <!-- FIELD "P09" -->
            <field>
              <name>P09</name>
              <description>Bit9 of FPDOR0</description>
              <msb>9</msb>
              <lsb>9</lsb>
              <access>read-only</access>
            </field>
            <!-- FIELD "P08" -->
            <field>
              <name>P08</name>
              <description>Bit8 of FPDOR0</description>
              <msb>8</msb>
              <lsb>8</lsb>
              <access>read-only</access>
            </field>
            <!-- FIELD "P07" -->
            <field>
              <name>P07</name>
              <description>Bit7 of FPDOR0</description>
              <msb>7</msb>
              <lsb>7</lsb>
              <access>read-only</access>
            </field>
            <!-- FIELD "P06" -->
            <field>
              <name>P06</name>
              <description>Bit6 of FPDOR0</description>
              <msb>6</msb>
              <lsb>6</lsb>
              <access>read-only</access>
            </field>
            <!-- FIELD "P05" -->
            <field>
              <name>P05</name>
              <description>Bit5 of FPDOR0</description>
              <msb>5</msb>
              <lsb>5</lsb>
              <access>read-only</access>
            </field>
            <!-- FIELD "P04" -->
            <field>
              <name>P04</name>
              <description>Bit4 of FPDOR0</description>
              <msb>4</msb>
              <lsb>4</lsb>
              <access>read-only</access>
            </field>
            <!-- FIELD "P03" -->
            <field>
              <name>P03</name>
              <description>Bit3 of FPDOR0</description>
              <msb>3</msb>
              <lsb>3</lsb>
              <access>read-only</access>
            </field>
            <!-- FIELD "P02" -->
            <field>
              <name>P02</name>
              <description>Bit2 of FPDOR0</description>
              <msb>2</msb>
              <lsb>2</lsb>
              <access>read-only</access>
            </field>
            <!-- FIELD "P01" -->
            <field>
              <name>P01</name>
              <description>Bit1 of FPDOR0</description>
              <msb>1</msb>
              <lsb>1</lsb>
              <access>read-only</access>
            </field>
            <!-- FIELD "P00" -->
            <field>
              <name>P00</name>
              <description>Bit0 of FPDOR0</description>
              <msb>0</msb>
              <lsb>0</lsb>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <!-- REGISTER "FPDOR1" -->
        <register>
          <name>FPDOR1</name>
          <description>Fast GPIO Output Data Register 1</description>
          <addressOffset>0x44</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x00007FFF</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "P1E" -->
            <field>
              <name>P1E</name>
              <description>Bit14 of FPDOR1</description>
              <msb>14</msb>
              <lsb>14</lsb>
              <access>read-only</access>
            </field>
            <!-- FIELD "P1D" -->
            <field>
              <name>P1D</name>
              <description>Bit13 of FPDOR1</description>
              <msb>13</msb>
              <lsb>13</lsb>
              <access>read-only</access>
            </field>
            <!-- FIELD "P1C" -->
            <field>
              <name>P1C</name>
              <description>Bit12 of FPDOR1</description>
              <msb>12</msb>
              <lsb>12</lsb>
              <access>read-only</access>
            </field>
            <!-- FIELD "P1B" -->
            <field>
              <name>P1B</name>
              <description>Bit11 of FPDOR1</description>
              <msb>11</msb>
              <lsb>11</lsb>
              <access>read-only</access>
            </field>
            <!-- FIELD "P1A" -->
            <field>
              <name>P1A</name>
              <description>Bit10 of FPDOR1</description>
              <msb>10</msb>
              <lsb>10</lsb>
              <access>read-only</access>
            </field>
            <!-- FIELD "P19" -->
            <field>
              <name>P19</name>
              <description>Bit9 of FPDOR1</description>
              <msb>9</msb>
              <lsb>9</lsb>
              <access>read-only</access>
            </field>
            <!-- FIELD "P18" -->
            <field>
              <name>P18</name>
              <description>Bit8 of FPDOR1</description>
              <msb>8</msb>
              <lsb>8</lsb>
              <access>read-only</access>
            </field>
            <!-- FIELD "P17" -->
            <field>
              <name>P17</name>
              <description>Bit7 of FPDOR1</description>
              <msb>7</msb>
              <lsb>7</lsb>
              <access>read-only</access>
            </field>
            <!-- FIELD "P16" -->
            <field>
              <name>P16</name>
              <description>Bit6 of FPDOR1</description>
              <msb>6</msb>
              <lsb>6</lsb>
              <access>read-only</access>
            </field>
            <!-- FIELD "P15" -->
            <field>
              <name>P15</name>
              <description>Bit5 of FPDOR1</description>
              <msb>5</msb>
              <lsb>5</lsb>
              <access>read-only</access>
            </field>
            <!-- FIELD "P14" -->
            <field>
              <name>P14</name>
              <description>Bit4 of FPDOR1</description>
              <msb>4</msb>
              <lsb>4</lsb>
              <access>read-only</access>
            </field>
            <!-- FIELD "P13" -->
            <field>
              <name>P13</name>
              <description>Bit3 of FPDOR1</description>
              <msb>3</msb>
              <lsb>3</lsb>
              <access>read-only</access>
            </field>
            <!-- FIELD "P12" -->
            <field>
              <name>P12</name>
              <description>Bit2 of FPDOR1</description>
              <msb>2</msb>
              <lsb>2</lsb>
              <access>read-only</access>
            </field>
            <!-- FIELD "P11" -->
            <field>
              <name>P11</name>
              <description>Bit1 of FPDOR1</description>
              <msb>1</msb>
              <lsb>1</lsb>
              <access>read-only</access>
            </field>
            <!-- FIELD "P10" -->
            <field>
              <name>P10</name>
              <description>Bit0 of FPDOR1</description>
              <msb>0</msb>
              <lsb>0</lsb>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <!-- REGISTER "FPDOR2" -->
        <register>
          <name>FPDOR2</name>
          <description>Fast GPIO Output Data Register 2</description>
          <addressOffset>0x48</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x000001FF</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "P28" -->
            <field>
              <name>P28</name>
              <description>Bit8 of FPDOR2</description>
              <msb>8</msb>
              <lsb>8</lsb>
              <access>read-only</access>
            </field>
            <!-- FIELD "P27" -->
            <field>
              <name>P27</name>
              <description>Bit7 of FPDOR2</description>
              <msb>7</msb>
              <lsb>7</lsb>
              <access>read-only</access>
            </field>
            <!-- FIELD "P26" -->
            <field>
              <name>P26</name>
              <description>Bit6 of FPDOR2</description>
              <msb>6</msb>
              <lsb>6</lsb>
              <access>read-only</access>
            </field>
            <!-- FIELD "P25" -->
            <field>
              <name>P25</name>
              <description>Bit5 of FPDOR2</description>
              <msb>5</msb>
              <lsb>5</lsb>
              <access>read-only</access>
            </field>
            <!-- FIELD "P24" -->
            <field>
              <name>P24</name>
              <description>Bit4 of FPDOR2</description>
              <msb>4</msb>
              <lsb>4</lsb>
              <access>read-only</access>
            </field>
            <!-- FIELD "P23" -->
            <field>
              <name>P23</name>
              <description>Bit3 of FPDOR2</description>
              <msb>3</msb>
              <lsb>3</lsb>
              <access>read-only</access>
            </field>
            <!-- FIELD "P22" -->
            <field>
              <name>P22</name>
              <description>Bit2 of FPDOR2</description>
              <msb>2</msb>
              <lsb>2</lsb>
              <access>read-only</access>
            </field>
            <!-- FIELD "P21" -->
            <field>
              <name>P21</name>
              <description>Bit1 of FPDOR2</description>
              <msb>1</msb>
              <lsb>1</lsb>
              <access>read-only</access>
            </field>
            <!-- FIELD "P20" -->
            <field>
              <name>P20</name>
              <description>Bit1 of FPDOR2</description>
              <msb>0</msb>
              <lsb>0</lsb>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <!-- REGISTER "FPDOR3" -->
        <register>
          <name>FPDOR3</name>
          <description>Fast GPIO Output Data Register 3</description>
          <addressOffset>0x4C</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x0000FFFF</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "P3F" -->
            <field>
              <name>P3F</name>
              <description>Bit15 of FPDOR3</description>
              <msb>15</msb>
              <lsb>15</lsb>
              <access>read-only</access>
            </field>
            <!-- FIELD "P3E" -->
            <field>
              <name>P3E</name>
              <description>Bit14 of FPDOR3</description>
              <msb>14</msb>
              <lsb>14</lsb>
              <access>read-only</access>
            </field>
            <!-- FIELD "P3D" -->
            <field>
              <name>P3D</name>
              <description>Bit13 of FPDOR3</description>
              <msb>13</msb>
              <lsb>13</lsb>
              <access>read-only</access>
            </field>
            <!-- FIELD "P3C" -->
            <field>
              <name>P3C</name>
              <description>Bit12 of FPDOR3</description>
              <msb>12</msb>
              <lsb>12</lsb>
              <access>read-only</access>
            </field>
            <!-- FIELD "P3B" -->
            <field>
              <name>P3B</name>
              <description>Bit11 of FPDOR3</description>
              <msb>11</msb>
              <lsb>11</lsb>
              <access>read-only</access>
            </field>
            <!-- FIELD "P3A" -->
            <field>
              <name>P3A</name>
              <description>Bit10 of FPDOR3</description>
              <msb>10</msb>
              <lsb>10</lsb>
              <access>read-only</access>
            </field>
            <!-- FIELD "P39" -->
            <field>
              <name>P39</name>
              <description>Bit9 of FPDOR3</description>
              <msb>9</msb>
              <lsb>9</lsb>
              <access>read-only</access>
            </field>
            <!-- FIELD "P38" -->
            <field>
              <name>P38</name>
              <description>Bit8 of FPDOR3</description>
              <msb>8</msb>
              <lsb>8</lsb>
              <access>read-only</access>
            </field>
            <!-- FIELD "P37" -->
            <field>
              <name>P37</name>
              <description>Bit7 of FPDOR3</description>
              <msb>7</msb>
              <lsb>7</lsb>
              <access>read-only</access>
            </field>
            <!-- FIELD "P36" -->
            <field>
              <name>P36</name>
              <description>Bit6 of FPDOR3</description>
              <msb>6</msb>
              <lsb>6</lsb>
              <access>read-only</access>
            </field>
            <!-- FIELD "P35" -->
            <field>
              <name>P35</name>
              <description>Bit5 of FPDOR3</description>
              <msb>5</msb>
              <lsb>5</lsb>
              <access>read-only</access>
            </field>
            <!-- FIELD "P34" -->
            <field>
              <name>P34</name>
              <description>Bit4 of FPDOR3</description>
              <msb>4</msb>
              <lsb>4</lsb>
              <access>read-only</access>
            </field>
            <!-- FIELD "P33" -->
            <field>
              <name>P33</name>
              <description>Bit3 of FPDOR3</description>
              <msb>3</msb>
              <lsb>3</lsb>
              <access>read-only</access>
            </field>
            <!-- FIELD "P32" -->
            <field>
              <name>P32</name>
              <description>Bit2 of FPDOR3</description>
              <msb>2</msb>
              <lsb>2</lsb>
              <access>read-only</access>
            </field>
            <!-- FIELD "P31" -->
            <field>
              <name>P31</name>
              <description>Bit1 of FPDOR3</description>
              <msb>1</msb>
              <lsb>1</lsb>
              <access>read-only</access>
            </field>
            <!-- FIELD "P30" -->
            <field>
              <name>P30</name>
              <description>Bit0 of FPDOR3</description>
              <msb>0</msb>
              <lsb>0</lsb>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <!-- REGISTER "FPDOR4" -->
        <register>
          <name>FPDOR4</name>
          <description>Fast GPIO Output Data Register 4</description>
          <addressOffset>0x50</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x00003FFF</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "P4D" -->
            <field>
              <name>P4D</name>
              <description>Bit13 of FPDOR4</description>
              <msb>13</msb>
              <lsb>13</lsb>
              <access>read-only</access>
            </field>
            <!-- FIELD "P4C" -->
            <field>
              <name>P4C</name>
              <description>Bit12 of FPDOR4</description>
              <msb>12</msb>
              <lsb>12</lsb>
              <access>read-only</access>
            </field>
            <!-- FIELD "P4B" -->
            <field>
              <name>P4B</name>
              <description>Bit11 of FPDOR4</description>
              <msb>11</msb>
              <lsb>11</lsb>
              <access>read-only</access>
            </field>
            <!-- FIELD "P4A" -->
            <field>
              <name>P4A</name>
              <description>Bit10 of FPDOR4</description>
              <msb>10</msb>
              <lsb>10</lsb>
              <access>read-only</access>
            </field>
            <!-- FIELD "P49" -->
            <field>
              <name>P49</name>
              <description>Bit9 of FPDOR4</description>
              <msb>9</msb>
              <lsb>9</lsb>
              <access>read-only</access>
            </field>
            <!-- FIELD "P48" -->
            <field>
              <name>P48</name>
              <description>Bit8 of FPDOR4</description>
              <msb>8</msb>
              <lsb>8</lsb>
              <access>read-only</access>
            </field>
            <!-- FIELD "P47" -->
            <field>
              <name>P47</name>
              <description>Bit7 of FPDOR4</description>
              <msb>7</msb>
              <lsb>7</lsb>
              <access>read-only</access>
            </field>
            <!-- FIELD "P46" -->
            <field>
              <name>P46</name>
              <description>Bit6 of FPDOR4</description>
              <msb>6</msb>
              <lsb>6</lsb>
              <access>read-only</access>
            </field>
            <!-- FIELD "P45" -->
            <field>
              <name>P45</name>
              <description>Bit5 of FPDOR4</description>
              <msb>5</msb>
              <lsb>5</lsb>
              <access>read-only</access>
            </field>
            <!-- FIELD "P44" -->
            <field>
              <name>P44</name>
              <description>Bit4 of FPDOR4</description>
              <msb>4</msb>
              <lsb>4</lsb>
              <access>read-only</access>
            </field>
            <!-- FIELD "P43" -->
            <field>
              <name>P43</name>
              <description>Bit3 of FPDOR4</description>
              <msb>3</msb>
              <lsb>3</lsb>
              <access>read-only</access>
            </field>
            <!-- FIELD "P42" -->
            <field>
              <name>P42</name>
              <description>Bit2 of FPDOR4</description>
              <msb>2</msb>
              <lsb>2</lsb>
              <access>read-only</access>
            </field>
            <!-- FIELD "P41" -->
            <field>
              <name>P41</name>
              <description>Bit1 of FPDOR4</description>
              <msb>1</msb>
              <lsb>1</lsb>
              <access>read-only</access>
            </field>
            <!-- FIELD "P40" -->
            <field>
              <name>P40</name>
              <description>Bit0 of FPDOR4</description>
              <msb>0</msb>
              <lsb>0</lsb>
              <access>read-only</access>
            </field>
          </fields>
        </register>
